[
{
  "index": 7,
  "title": "#7 3 weeks since two young children reported missing in rural Nova Scotia",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/three-weeks-since-two-young-children-reported-missing-in-rural-nova-scotia/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "children",
    "missing",
    "weeks",
    "sullivan",
    "search",
    "rcmp",
    "children’s",
    "interview",
    "investigators",
    "evidence",
    "family’s",
    "lansdowne",
    "station",
    "day",
    "volunteers",
    "kilometres",
    "road",
    "woods",
    "canadian",
    "press",
    "100",
    "offered",
    "tests",
    "mounties",
    "identified",
    "young",
    "reported",
    "rural",
    "northeastern",
    "nova",
    "scotia",
    "pointing",
    "whereabouts",
    "six-year-old",
    "lilly"
  ],
  "summary": "It has been three weeks since two young children were reported missing from their rural home in northeastern Nova Scotia, and police have yet to say if they have found any evidence pointing to their whereabouts.\nPolice say they believe six-year-old Lilly Sullivan and her four-year-old brother Jack wandered away from their family’s home in Lansdowne Station, N.S., early on May 2.\nLater that day, Daniel Robert Martell, who has described himself as the missing children’s stepfather, told The Canadian Press that he had voluntarily attended a four-hour interview with major crime investigators.\nPolice have repeatedly said there is no evidence to suggest the children were abducted.\nAs the latest search ended on Sunday, police said the results would be carefully reviewed by investigators and search managers.",
  "scraped_at": "2025-05-24T14:38:21.362444"
},
{
  "index": 3,
  "title": "#3 2024 sees record warm temperatures, less sea ice cover in Gulf of St. Lawrence",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/2024-sees-record-warm-temperatures-less-sea-ice-cover-in-gulf-of-st-lawrence/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "sees",
    "warm",
    "ice",
    "gulf",
    "sea",
    "cover",
    "st",
    "lawrence",
    "temperatures",
    "record",
    "2024",
    "temperature",
    "surface",
    "galbraith",
    "pups",
    "average",
    "recorded",
    "air",
    "warmest",
    "winter",
    "winters",
    "harp",
    "van",
    "walle",
    "seals",
    "birth",
    "mont-joli",
    "highest",
    "lowest",
    "seasonal",
    "volume",
    "fisheries",
    "department",
    "data",
    "warmer"
  ],
  "summary": "Between May and November, the warmest surface temperature was 11.6 C, also a record, and 1.6 C higher than average.\n“So it was the warmest air temperature, which gave us the warmest sea surface temperature,” Galbraith said.\nAside from having the highest surface temperature in 2024, the Gulf of St. Lawrence also recorded the lowest seasonal ice cover since 1969.\nThe two winters are among the seven winters since 1969 that saw almost no sea ice.\nThe gulf herd breeds near the Iles-de-la-Madeleine in the middle of the Gulf of St. Lawrence.",
  "scraped_at": "2025-05-24T14:38:27.206341"
},
{
  "index": 9,
  "title": "#9 P.E.I. residents are happy with police, dissatisfied on responses to drunk driving",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/22/p-e-i-residents-are-happy-with-police-dissatisfied-on-responses-to-drunk-driving/",
  "publish_date": "2025-05-22T00:00:00",
  "keywords": [
    "happy",
    "drunk",
    "driving",
    "cent",
    "dissatisfied",
    "responses",
    "residents",
    "p",
    "satisfied",
    "respondents",
    "policing",
    "officers",
    "issues",
    "crime",
    "addiction",
    "mental",
    "health",
    "canadian",
    "press",
    "charlottetown",
    "survey",
    "majority",
    "prince",
    "edward",
    "island",
    "generally",
    "communities",
    "unhappy",
    "respond",
    "specific",
    "societal",
    "problems",
    "poll",
    "conducted",
    "léger"
  ],
  "summary": "government, asked 926 Islanders what they thought of police responses to issues such as crime and addiction and mental health calls.\nSixty-two per cent of respondents said they trusted police; 61 per cent said officers were professional.\nHowever, only 26 per cent of respondents said they were satisfied with police responses to substance abuse, addiction and mental health issues, and 34 per cent said they were dissatisfied.\nThirty-nine per cent of respondents said they were satisfied with the way police address violent crime, with 17 per cent dissatisfied.\nFor impaired driving, 39 per cent were satisfied and 45 per cent dissatisfied.",
  "scraped_at": "2025-05-24T14:38:27.767788"
},
{
  "index": 2,
  "title": "#2 Moncton Wildcats coach Gardiner MacDougall seeks yet another trophy at Memorial Cup",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/moncton-wildcats-coach-gardiner-macdougall-seeks-yet-another-trophy-at-memorial-cup/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "seeks",
    "trophy",
    "macdougall",
    "moncton",
    "coach",
    "wildcats",
    "memorial",
    "cup",
    "gardiner",
    "he’s",
    "unb",
    "hockey",
    "canadian",
    "lady",
    "macdougall’s",
    "team",
    "league",
    "it’s",
    "season",
    "job",
    "nhl",
    "son",
    "taylor",
    "special",
    "father",
    "gill",
    "mo",
    "winner",
    "university",
    "wins",
    "gold",
    "title",
    "record",
    "moncton’s",
    "bench"
  ],
  "summary": "And in his first season behind Moncton’s bench, MacDougall led the Wildcats to a Quebec Maritimes Junior Hockey League championship.\nMacDougall arrived in Moncton one year ago after 24 sparkling seasons with the UNB Reds, where he recorded the most regular-season wins in Canadian men’s university hockey.\nGrowing up, Gill attended UNB hockey camps in Fredericton.\nHis father once told MacDougall he wanted his son to play for the Reds — a moment the coach still remembered years later.\n“But the key to success tonight was a lady called Lady Mo — Miss Lady Momentum.",
  "scraped_at": "2025-05-24T14:38:28.217562"
},
{
  "index": 10,
  "title": "#10 Judge rules Newfoundland parishioners must hand over their church to be sold",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/22/judge-rules-newfoundland-parishioners-must-hand-over-their-church-to-be-sold/",
  "publish_date": "2025-05-22T00:00:00",
  "keywords": [
    "rules",
    "hand",
    "sold",
    "church",
    "parishioners",
    "judge",
    "newfoundland",
    "court",
    "decision",
    "archdiocese",
    "st",
    "john’s",
    "handrigan",
    "portugal",
    "cove",
    "south",
    "abuse",
    "roman",
    "catholic",
    "corporation",
    "group",
    "historical",
    "survivors",
    "sexual",
    "supreme",
    "control",
    "residents",
    "wrote",
    "assets",
    "orphanage",
    "order",
    "hearing",
    "earlier",
    "month",
    "canadian"
  ],
  "summary": "ST. JOHN’S — A judge has ordered parishioners in southeastern Newfoundland to hand over their church so it can be sold to pay survivors of sexual abuse.\nIn a court hearing earlier this month, a lawyer for the group of parishioners — called the Portugal Cove South Historical Corporation — argued the organization reasonably believed it owned the church.\nBut Handrigan’s decision declared that the archdiocese owns the church and has a right to sell it.\n“That’s who we are as a people, of course we will abide by a court decision,” she said.\nPortugal Cove South is a fishing community about 100 kilometres southwest of St. John’s, and it is home to about 85 people.",
  "scraped_at": "2025-05-24T14:38:29.024043"
},
{
  "index": 8,
  "title": "#8 Police dismantle alleged fraud ring that targeted car dealerships in 5 provinces",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/22/police-dismantle-alleged-fraud-ring-that-targeted-car-dealerships-in-5-provinces/",
  "publish_date": "2025-05-22T00:00:00",
  "keywords": [
    "dismantle",
    "alleged",
    "targeted",
    "car",
    "fraud",
    "ring",
    "provinces",
    "dealerships",
    "vehicles",
    "mascouche",
    "quebec",
    "arrested",
    "luxury",
    "22",
    "ontario",
    "suspects",
    "que",
    "montreal",
    "canadian",
    "press",
    "trois-rivières",
    "provincial",
    "they’ve",
    "connection",
    "manitoba",
    "brunswick",
    "nova",
    "scotia",
    "defrauded",
    "million",
    "2022",
    "2023",
    "release",
    "obtained",
    "worth"
  ],
  "summary": "TROIS-RIVIÈRES — Quebec provincial police say they’ve arrested three people in connection with a luxury car fraud ring across five provinces.\nThey say 22 car dealerships in Ontario, Quebec, Manitoba, New Brunswick and Nova Scotia were defrauded of more than $3.3 million between 2022 and 2023.\nOnce in possession of the luxury vehicles, the suspects would then allegedly export them overseas.\nPolice say the cell originated in Mascouche, Que., a suburb north of Montreal, and that two of the vehicles were recovered during the investigation.\nPolice say they are still looking for a 42-year-old man, also from Mascouche, connected to the case.",
  "scraped_at": "2025-05-24T14:38:29.613015"
},
{
  "index": 5,
  "title": "#5 Blooms may be delayed by cold weather but plants 'tougher than the gardeners'",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/blooms-may-be-delayed-by-cold-weather-but-plants-tougher-than-the-gardeners/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "blooms",
    "delayed",
    "tougher",
    "weather",
    "plants",
    "cold",
    "gardeners",
    "temperatures",
    "week",
    "parker",
    "flowers",
    "bit",
    "canada",
    "cooler",
    "rain",
    "usual",
    "snap",
    "morning",
    "garden",
    "environment",
    "system",
    "wet",
    "they’re",
    "toronto",
    "horticultural",
    "cut",
    "gardening",
    "spring",
    "growing",
    "shrubs",
    "veggies",
    "seedlings",
    "night",
    "afternoon",
    "long"
  ],
  "summary": "Gardening is always hands on, but Mary Parker is babying her plants a little longer than usual this spring.\nBut this week, Maepea said, a low weather system moved in and brought a cold snap that lingered.\n“We’re seeing a lot of cloud and showers on and off, and some drizzle, which results in the cooler temperatures, too,” she said.\n“They’re used to surviving, and they’re probably tougher than the gardeners.” Still, the cold, wet weather came at an inconvenient time for some of Toronto’s most avid gardeners.\nHe said Ontario’s stubborn weather system is expected to bring cooler temperatures until midday Sunday.",
  "scraped_at": "2025-05-24T14:38:30.755864"
},
{
  "index": 6,
  "title": "#6 N.B.'s 3-member panel won't rule out sale of debt-laden power utility",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/n-b-announces-3-member-panel-who-will-review-future-of-debt-laden-power-utility/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "n",
    "b",
    "s",
    "3-member",
    "panel",
    "won’t",
    "rule",
    "debt-laden",
    "power",
    "utility",
    "sale",
    "review",
    "nb",
    "team",
    "future",
    "brunswick",
    "lead",
    "public",
    "canadian",
    "utilities",
    "rates",
    "energy",
    "challenges",
    "brunswick’s",
    "table",
    "solutions",
    "members",
    "bernstein",
    "sector",
    "bertrand",
    "hawthorne",
    "province",
    "holt",
    "legacy",
    "process"
  ],
  "summary": "FREDERICTON — A three-person team who will lead a review of New Brunswick’s debt-laden public power utility says “nothing is off the table” when it comes to finding solutions.\nThe members are Michael Bernstein, who has worked in the Canadian power and utilities sector; Anne E. Bertrand, the province’s former information and privacy commissioner; and Duncan Hawthorne, an expert on utilities.\nPremier Susan Holt has said the status quo is not acceptable at NB Power, which is struggling with a $5-billion debt and rates that have increased more than 20 per cent in two years.\nSo how do we prepare NB power for that?” Holt has refused to speculate on whether a sale of the utility would be part of the review.\nThe point of the review, he said is to make sure NB Power is “fit for the future.” “Nothing’s off the table.",
  "scraped_at": "2025-05-24T14:38:31.214729"
},
{
  "index": 4,
  "title": "#4 Federal election: Newfoundland riding flips to Conservatives after judicial recount",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/23/federal-election-newfoundland-riding-flips-to-conservatives-after-judicial-recount/",
  "publish_date": "2025-05-23T00:00:00",
  "keywords": [
    "flips",
    "judicial",
    "election",
    "riding",
    "newfoundland",
    "federal",
    "conservatives",
    "recount",
    "party",
    "rowe",
    "germain",
    "12",
    "ballots",
    "seats",
    "st",
    "john’s",
    "seat",
    "house",
    "commons",
    "elections",
    "canada",
    "announced",
    "liberal",
    "terra",
    "peninsulas",
    "votes",
    "28",
    "win",
    "results",
    "thanked",
    "race",
    "province",
    "vote",
    "month",
    "roughly"
  ],
  "summary": "ST. JOHN’S — A federal election riding in rural Newfoundland flipped to the Conservatives on Friday, netting the party another seat in the House of Commons.\nThe result reverses the first tally of the ballots after the April 28 election, which had Germain ahead by 12 votes.\nThe opposition party now holds three of the seven federal seats in Newfoundland and Labrador.\nIt was one of four called after the election last month, and it was the last to produce a decision.\nThe riding is home to more than 76,000 people, 41,670 of whom cast a vote in the April 28 election.",
  "scraped_at": "2025-05-24T14:38:31.650825"
},
{
  "index": 1,
  "title": "#1 Video released by U.S. Coast Guard captures moment of Titan submersible implosion",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/24/video-released-by-u-s-coast-guard-captures-moment-of-titan-submersible-implosion/",
  "publish_date": "2025-05-24T00:00:00",
  "keywords": [
    "released",
    "captures",
    "moment",
    "video",
    "titan",
    "submersible",
    "coast",
    "implosion",
    "guard",
    "s",
    "rush",
    "sound",
    "titanic",
    "wendy",
    "titan’s",
    "vessel",
    "polar",
    "prince",
    "board",
    "wreckage",
    "oceangate",
    "foss",
    "members",
    "tracking",
    "team",
    "screens",
    "support",
    "noise",
    "heard",
    "dropped",
    "weights",
    "surface",
    "ocean",
    "report",
    "newfoundland"
  ],
  "summary": "HALIFAX — Newly released video contains a sound investigators believe is the moment the Titan submersible imploded as it dove on the wreck of the Titanic nearly two years ago.\nThe June 18, 2023 implosion claimed the lives of five people, including OceanGate Expeditions CEO Stockton Rush, who was pilot of the submersible.\nSeconds after the sound, Wendy Rush acknowledges receiving a text message showing the submersible had dropped two of its weights as it descended.\nThe video — first reported by BBC — was posted Thursday on a U.S. Defense Department website.\nThe coast guard’s Marine Board of Investigation held public hearings into the disaster last year, with a final report expected later this year.",
  "scraped_at": "2025-05-24T14:38:32.130233"
}
]