[
{
  "index": 2,
  "title": "#2 Lone survivor of Falmouth crash in stable condition; fundraisers set up",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/05/16/lone-survivor-of-falmouth-crash-in-stable-condition-fundraisers-set-up/",
  "publish_date": "2025-05-16T00:00:00",
  "keywords": [
    "lone",
    "falmouth",
    "crash",
    "killed",
    "stable",
    "condition",
    "survivor",
    "saunders",
    "allen",
    "family",
    "fundraiser",
    "nissan",
    "sentra",
    "man",
    "amanda",
    "collision",
    "carrying",
    "45-year-old",
    "woman",
    "travelling",
    "honda",
    "civic",
    "injuries",
    "unexpected",
    "hospital",
    "halifax",
    "father",
    "community",
    "gofundme",
    "allen’s",
    "gave",
    "parents",
    "randy",
    "colby",
    "two-vehicle"
  ],
  "summary": "Colby Allen was the only survivor in a two-vehicle collision that claimed the lives of five people last weekend.\nThe 29-year-old was in the backseat of a Nissan Sentra that was carrying three other people — a 45-year-old woman, a 58-year-old man and a 50-year-old man — travelling down Highway 101 between Hantsport and Falmouth near Windsor, N.S.\nJust after 11 p.m. on May 10, a Honda Civic, carrying a 43-year-old man and a 45-year-old woman travelling in the opposite direction of traffic collided with the Nissan Sentra.\nAllen was the lone survivor in the collision.\nThey were in the Nissan Sentra when the crash happened.",
  "scraped_at": "2025-05-16T19:43:55.653230"
},
{
  "index": 4,
  "title": "#4 N.S. health minister admits 'growing pains' with new free parking policy at hospitals",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/16/health-minister-says-teaks-needed-to-address-free-parking-woes-at-halifax-hospitals/",
  "publish_date": "2025-05-16T00:00:00",
  "keywords": [
    "admits",
    "growing",
    "pains",
    "health",
    "parking",
    "free",
    "hospital",
    "minister",
    "authority",
    "hospitals",
    "staff",
    "spaces",
    "nova",
    "scotia",
    "issue",
    "unauthorized",
    "vehicles",
    "halifax",
    "infirmary",
    "victoria",
    "general",
    "seeking",
    "power",
    "500",
    "tickets",
    "advantage",
    "emailed",
    "halifax-area",
    "today",
    "working",
    "preserve",
    "patients",
    "visitors",
    "authorized",
    "message"
  ],
  "summary": "The health authority in Nova Scotia says it is seeking the power to issue $500 tickets to unauthorized vehicles that take advantage of free parking at hospitals.\nNova Scotia Health emailed Halifax-area hospital staff today to say it is working to preserve spaces for patients, visitors, and authorized staff.\nThe message comes a day after Health Minister Michelle Thompson acknowledged “growing pains” as hospitals adjust to the province’s new free parking policy that took effect May 1.\nThe health authority says that until it can ticket drivers it will issue warnings to unauthorized vehicles, and offer 175 additional free on-site parking spaces to staff at the Halifax Infirmary and Victoria General Hospital.\nThe health authority says the Halifax Infirmary and Victoria General hospital together need almost 4,000 more parking spaces than are currently available to meet peak demand.",
  "scraped_at": "2025-05-16T19:43:56.152521"
},
{
  "index": 1,
  "title": "#1 Still no decision in federal election vote recount in rural Newfoundland riding",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/16/still-no-decision-in-federal-election-vote-recount-in-rural-newfoundland-riding/",
  "publish_date": "2025-05-16T00:00:00",
  "keywords": [
    "rural",
    "recount",
    "riding",
    "election",
    "decision",
    "federal",
    "vote",
    "newfoundland",
    "votes",
    "cast",
    "st",
    "john’s",
    "200",
    "elections",
    "officials",
    "000",
    "ballots",
    "canadian",
    "press",
    "long",
    "weekend",
    "looms",
    "central",
    "terra",
    "nova",
    "peninsulas",
    "judicial",
    "began",
    "marystown",
    "n",
    "l",
    "community",
    "kilometres",
    "southwest",
    "provincial"
  ],
  "summary": "ST. JOHN’S — A long weekend looms with no decision yet in a federal election vote recount in the central Newfoundland riding of Terra Nova–The Peninsulas.\nThe judicial recount began Monday in Marystown, N.L., a community of about 5,200 people about 200 kilometres southwest of the provincial capital of St. John’s.\nIt was triggered automatically when the initial final tally of the votes cast in the April 28 election showed Liberal Anthony Germain ahead of Conservative Jonathan Rowe by just 12 votes.\nElections Canada officials have said all votes cast in the riding – more than 41,000 – have been recounted.\nThe recount is one of two in progress in the country – elections officials are also reviewing ballots cast in the Ontario riding of Milton East–Halton Hills South.",
  "scraped_at": "2025-05-16T19:44:02.453838"
},
{
  "index": 3,
  "title": "#3 Halifax Wanderers to host Wrexham AFC in under-21 series in Atlantic Canada in July",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/16/halifax-wanderers-to-host-wrexham-afc-in-under-21-series-in-atlantic-canada-in-july/",
  "publish_date": "2025-05-16T00:00:00",
  "keywords": [
    "host",
    "wanderers",
    "halifax",
    "wrexham",
    "series",
    "afc",
    "under-21",
    "canada",
    "atlantic",
    "charlottetown",
    "saint",
    "john",
    "canadian",
    "england’s",
    "team",
    "young",
    "three-game",
    "grounds",
    "actor",
    "professional",
    "football",
    "world",
    "summer",
    "development",
    "clubs",
    "game",
    "opportunity",
    "players",
    "soccer",
    "opportunities",
    "press",
    "play",
    "kick",
    "moving",
    "n"
  ],
  "summary": "HALIFAX — Halifax Wanderers will play Wrexham AFC in a three-game under-21 series in July in Atlantic Canada.\nThe series will kick off July 5 at the Wanderers Grounds in Halifax before moving to Charlottetown on July 9 and Saint John, N.B., on July 12.\nThis marks the third edition of the Wanderers’ International Summer Series, which pits a Wanderers development team against pro sides from overseas.\n“Wrexham AFC has become a truly global brand and is one of the fastest rising clubs in world football so we are thrilled to welcome them to the Maritimes this summer,” Halifax Wanderers president Derek Martin said in a statement.\nIn 2024, the series expanded to five cities, with the Wanderers under-21 side facing U-21 teams from England’s Ipswich Town and Middlesbrough.",
  "scraped_at": "2025-05-16T19:44:03.310658"
},
{
  "index": 5,
  "title": "#5 No action against N.S. rent loophole out of fears for housing supply: minister",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/no-action-against-nova-scotia-rent-loophole-out-of-fears-for-housing-supply-minister/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "action",
    "n",
    "s",
    "loophole",
    "fears",
    "supply",
    "rent",
    "minister",
    "housing",
    "fixed-term",
    "leases",
    "lease",
    "balser",
    "cent",
    "cap",
    "focus",
    "landlords",
    "nova",
    "rules",
    "department",
    "doesn’t",
    "reporters",
    "vacancy",
    "ndp",
    "acting",
    "mombourquette",
    "place",
    "end",
    "don’t",
    "problem",
    "leblanc",
    "government’s",
    "periodic",
    "responsible",
    "scotia’s"
  ],
  "summary": "The minister responsible for Nova Scotia’s rental property rules says her department won’t crack down on instances of abuse involving fixed-term rent leases because it doesn’t want to affect the housing supply.\nHowever, she did not specify how the housing supply would be affected, under repeated questioning by reporters.\n“We have seen the misuse of fixed-term leases and it is extremely disappointing, but again our focus has always been on supply,” she said.\nThe provincial rent cap covers periodic leases and situations in which a landlord signs a new fixed-term lease with the same tenant, but it does not cover fixed-term leases with new tenants.\nLast fall, a number of landlords defended the use of fixed-term leases before a legislature committee, saying it helped them recoup costs in the face of the government’s rent cap.",
  "scraped_at": "2025-05-16T19:44:03.824332"
},
{
  "index": 8,
  "title": "#8 Atlantic Canada's lobster industry stung by low prices, global economic turmoil",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/atlantic-canadas-lobster-industry-stung-by-low-prices-and-global-economic-turmoil/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "industry",
    "low",
    "lobster",
    "canada",
    "atlantic",
    "prices",
    "nova",
    "price",
    "seafood",
    "pound",
    "canadian",
    "cent",
    "scotia",
    "live",
    "15",
    "china",
    "harvesters",
    "catches",
    "recent",
    "season",
    "tariffs",
    "fishers",
    "canada’s",
    "fishing",
    "scotia’s",
    "chinese",
    "lamont",
    "it’s",
    "they’re",
    "typically",
    "spring",
    "high",
    "berry",
    "association",
    "big"
  ],
  "summary": "Lobster harvesters in Atlantic Canada aren’t thrilled with the prices they’re getting for their catches, but experts say the recent downturn comes as no surprise due to uncertainty looming over the industry.\n“Everybody is very nervous.” The association represents lobster fishers, most of them in southwestern Nova Scotia.\nOn March 10, China announced a 25-per-cent retaliatory tariff on Canadian seafood in response to Canadian duties imposed last fall on Chinese-made electric vehicles, steel and aluminum.\nThe new duties have effectively ended Canada’s $1.3-billion seafood trade with China, which happens to be Canada’s second-largest market for live lobster.\nEarlier this week, U.S. and Chinese officials rolled back most of their recent tit-for-tat tariffs, which was bad news for the Canadian lobster business.",
  "scraped_at": "2025-05-16T19:44:04.703323"
},
{
  "index": 7,
  "title": "#7 Investigation in limbo of N.S. police actions in wrongful conviction of Glen Assoun",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/investigation-in-limbo-of-n-s-police-actions-in-wrongful-conviction-of-glen-assoun/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "wrongfully",
    "convicted",
    "man",
    "limbo",
    "investigation",
    "case",
    "assoun",
    "actions",
    "officers",
    "statement",
    "nauss",
    "nova",
    "awaiting",
    "oversight",
    "potential",
    "wrongful",
    "conviction",
    "glen",
    "justice",
    "incident",
    "team",
    "body",
    "matter",
    "started",
    "scotia’s",
    "watchdog",
    "word",
    "agency",
    "investigate",
    "misconduct",
    "probe",
    "promised",
    "province’s",
    "liberal",
    "committed"
  ],
  "summary": "The province’s former Liberal government committed in September 2020 to an independent investigation of police actions in the case of Assoun, who spent 17 years in prison for the killing of his ex-girlfriend.\nBritish Columbia’s police oversight body had taken on the investigation but dropped the case 18 months ago because it said its officers were too busy.\nNauss says in a written statement Thursday that she appreciates concerns about the delay and understands it is a matter of national importance.\n“Getting this investigation started is a priority for me,” wrote Nauss.\n“This is a unique and unusual circumstance and I share the public interest in ensuring this is investigated and addressed,” she said.",
  "scraped_at": "2025-05-16T19:44:05.204325"
},
{
  "index": 9,
  "title": "#9 N.S. gets $170M over decade after signing housing infrastructure deal",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/nova-scotia-gets-170-million-over-10-years-after-signing-housing-infrastructure-deal/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "n",
    "s",
    "170m",
    "decade",
    "signing",
    "housing",
    "infrastructure",
    "deal",
    "federal",
    "fund",
    "projects",
    "nova",
    "minister",
    "province",
    "170",
    "million",
    "signed",
    "tilley",
    "funding",
    "scotia’s",
    "public",
    "works",
    "assist",
    "winter",
    "fred",
    "scotia",
    "10-year",
    "agreement",
    "canada",
    "weren’t",
    "announce",
    "earlier",
    "recent",
    "election",
    "told"
  ],
  "summary": "Nova Scotia’s public works minister says the province is getting $170 million from the federal government to assist with housing infrastructure, after a deal was signed last winter.\nFred Tilley says Nova Scotia signed the 10-year agreement under the Canada Housing Infrastructure Fund in February.\nTilley told reporters following a cabinet meeting that details on funding allocations will be released as the province identifies the projects it wants to support.\nThe minister says some of the $170 million could also be used to augment projects that can apply directly to Ottawa under a separate stream that’s part of the federal fund.\nThe $6 billion federal fund is aimed at accelerating housing projects by funding infrastructure for drinking water, wastewater, stormwater and solid waste.",
  "scraped_at": "2025-05-16T19:44:05.690403"
},
{
  "index": 6,
  "title": "#6 Saint John, N.B., police charge one of their own with assault, provide few details",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/saint-john-n-b-police-charge-one-of-their-own-with-assault-provide-few-details/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "charge",
    "provide",
    "john",
    "saint",
    "details",
    "assault",
    "n",
    "b",
    "force",
    "release",
    "public",
    "officer",
    "excessive",
    "investigation",
    "allegation",
    "sirt",
    "agency",
    "interest",
    "court",
    "canadian",
    "press",
    "st",
    "charged",
    "officers",
    "offering",
    "complaint",
    "prompted",
    "meet",
    "mandate",
    "incident",
    "response",
    "team",
    "independent",
    "oversight",
    "fredericton"
  ],
  "summary": "ST. JOHN — The police force in Saint John, N.B., said Thursday that it has charged one of its officers with assault.\nIn a news release offering few details, the Saint John Police Force said a public complaint about “excessive force” prompted an investigation into the officer.\n“Any complaints of excessive force are taken very seriously,” Chief Robert Bruce said in the release.\n“Although we recognize the public interest in this case, to protect the integrity of the ongoing investigation and court proceedings, the Saint John Police are not providing any further details at this time,” Staff Sgt.\nThe officer is scheduled to appear in court in July and has been reassigned to administrative duties, the force said.",
  "scraped_at": "2025-05-16T19:44:06.732120"
},
{
  "index": 10,
  "title": "#10 Halifax teen facing 33 charges to enter plea in youth court",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/15/halifax-teen-accused-of-threats-gun-possession-to-enter-plea-in-youth-court-june-5/",
  "publish_date": "2025-05-15T00:00:00",
  "keywords": [
    "teen",
    "school",
    "deal",
    "halifax",
    "threats",
    "accused",
    "enter",
    "plea",
    "counts",
    "facing",
    "charges",
    "uttering",
    "court",
    "youth",
    "teenager",
    "33",
    "including",
    "appearance",
    "video",
    "link",
    "jail",
    "judge",
    "barbara",
    "beach",
    "approved",
    "request",
    "16-year-old’s",
    "lawyer",
    "boy’s",
    "include",
    "12",
    "possessing",
    "weapon",
    "dangerous",
    "purpose"
  ],
  "summary": "A Halifax teenager facing 33 charges including uttering threats has made a brief court appearance through a video link from jail.\nYouth court Judge Barbara Beach approved a request from the 16-year-old’s lawyer for the accused to appear on June 5 to enter a plea.\nThe boy’s charges include 12 counts of possessing a weapon for a dangerous purpose, four counts of uttering threats to cause death or bodily harm, and seven counts of careless use of a firearm.\nThe youth is also facing two counts of willfully promoting hatred against identifiable groups.\nHalifax police said last month they arrested the boy in the early morning of April 24 after they received “credible information” he posed a threat to people at a high school.",
  "scraped_at": "2025-05-16T19:44:09.134675"
}
]