[
{
  "index": 10,
  "title": "#10 N.L. man's remains have gone unclaimed for a year. These two want to bring him home",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/02/an-n-l-mans-remains-have-gone-unclaimed-for-years-these-two-want-to-bring-him-home/",
  "publish_date": "2025-06-02T00:00:00",
  "keywords": [
    "man’s",
    "bring",
    "unclaimed",
    "remains",
    "n",
    "l",
    "list",
    "fraize",
    "french",
    "health",
    "st",
    "john’s",
    "money",
    "bury",
    "left",
    "crane",
    "published",
    "pub",
    "crane’s",
    "yetman",
    "claim",
    "newfoundland",
    "died",
    "authority",
    "harbour",
    "grace",
    "community",
    "death",
    "bennett",
    "officials",
    "burial",
    "26",
    "province",
    "rendell",
    "deceased"
  ],
  "summary": "The list published last week said Crane died in Harbour Grace, N.L., on Dec. 13, 2023.\nThe list was published according to new legislation allowing the health authority to bury or cremate unclaimed remains if a search for someone to take responsibility them is unsuccessful.\n“The goal here is to work with them to help get these people a dignified burial,” Johnson told reporters in St. John’s.\nShe and French are in touch with members of Crane’s family, who have begun the paperwork to claim his remains.\nAny money left over will go to the local funeral home to help other families who need help to bury a loved one.",
  "scraped_at": "2025-06-04T19:14:45.764590"
},
{
  "index": 2,
  "title": "#2 NS Power CEO, staff grilled over breach that allowed theft of 280,000 customers' data",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/04/committee-to-discuss-ns-power-breach-that-allowed-theft-of-280000-customers-data/",
  "publish_date": "2025-06-04T00:00:00",
  "keywords": [
    "discussing",
    "theft",
    "280k",
    "ns",
    "customers",
    "power",
    "committee",
    "data",
    "nova",
    "scotia",
    "breach",
    "company",
    "utility",
    "000",
    "utility’s",
    "ceo",
    "ransomware",
    "attack",
    "social",
    "insurance",
    "numbers",
    "investigation",
    "provincial",
    "politicians",
    "aim",
    "legislative",
    "meeting",
    "morning",
    "owes",
    "ratepayers",
    "answers",
    "cybersecurity",
    "gave",
    "thieves",
    "access"
  ],
  "summary": "Provincial politicians took aim at Nova Scotia Power during a legislative committee meeting this morning, saying the utility owes ratepayers answers after a cybersecurity breach gave thieves access to data belonging to 280,000 customers.\nThe utility’s CEO and other staff were grilled by the public accounts committee about how the breach happened and what the company will do to protect its customers from financial harm.\nNova Scotia Power CEO Peter Gregg says the ransomware attack affected almost half of the utility’s customers, including 140,000 customers who had given the utility their social insurance numbers.\nChris Heck, chief digital officer with Nova Scotia Power’s parent company Emera, told the committee that the company identified unusual activity on their server on April 25, but later determined the cyber-thieves had accessed the system as early as March 19.\nNDP Leader Claudia Chender pressed the two men to explain why Nova Scotia Power had been storing the social insurance numbers, but they declined to say, citing an ongoing investigation.",
  "scraped_at": "2025-06-04T19:14:46.592133"
},
{
  "index": 6,
  "title": "#6 Houston pitches project that could make Nova Scotia an 'energy superpower'",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/06/03/houston-pitches-project-that-could-make-nova-scotia-an-energy-superpower/",
  "publish_date": "2025-06-03T00:00:00",
  "keywords": [
    "pitches",
    "massive",
    "timelines",
    "energy",
    "houston",
    "clean",
    "project",
    "costs",
    "wind",
    "premier",
    "gigawatts",
    "nova",
    "scotia",
    "country",
    "video",
    "invest",
    "future",
    "canada",
    "offshore",
    "province",
    "west",
    "supports",
    "pipeline",
    "ready",
    "federal",
    "tim",
    "released",
    "details",
    "plan",
    "powerhouse",
    "foreseeable",
    "disclose",
    "premiers",
    "met",
    "prime"
  ],
  "summary": "Premier Tim Houston released some details on a plan to make Nova Scotia a clean energy powerhouse in the foreseeable future, however, he did not disclose any costs.\nThat evening, the Nova Scotia premier took to social media, saying his government is in the process of licensing five gigawatts of offshore wind energy.\n“Right now, Nova Scotia is on the edge of a clean energy breakthrough,” he said in the video.\nAccording to the premier, the province only uses about 2.4 gigawatts of energy at peak demand, meaning the remaining energy could be used elsewhere in the country.\nIn the video, the premier said he supports Carney’s vision for the country to be a big player in the energy sector.",
  "scraped_at": "2025-06-04T19:14:47.753511"
},
{
  "index": 9,
  "title": "#9 1 month since Sullivan children disappearance in rural Pictou County",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/06/02/1-month-since-sullivan-children-disappearance-in-rural-pictou-county/",
  "publish_date": "2025-06-02T00:00:00",
  "keywords": [
    "month",
    "timeline",
    "sullivan",
    "children's",
    "disappearance",
    "search",
    "rcmp",
    "children",
    "missing",
    "press",
    "children’s",
    "area",
    "searching",
    "lilly",
    "jack",
    "evidence",
    "road",
    "abduction",
    "there’s",
    "case",
    "public",
    "martell",
    "hoskins",
    "interview",
    "family",
    "reported",
    "investigation",
    "told",
    "days",
    "pair",
    "day",
    "gairloch",
    "alert",
    "weekend",
    "ground"
  ],
  "summary": "At the time of their disappearance, Lilly is said to be wearing a pink sweater, pink pants and pink boots.\nThe search area expanded to four kilometres wide and focused on the forest by the children’s home on Gairloch Road.\nMay 28: Timeline of events released Investigators said they have confirmed the last time two missing children were seen in public.\nRCMP said they have a timeline of when they were last seen by other people outside of their immediate family.\nThe Mounties add in the press release that they are “committed to exploring all possibilities” surrounding the children’s disappearance.",
  "scraped_at": "2025-06-04T19:14:50.937609"
},
{
  "index": 7,
  "title": "#7 Residents rally to oppose uranium mining in their community",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/02/hants-county-n-s-residents-rally-to-oppose-uranium-mining-in-the-region/",
  "publish_date": "2025-06-02T00:00:00",
  "keywords": [
    "rally",
    "oppose",
    "uranium",
    "mining",
    "community",
    "residents",
    "province",
    "county",
    "meeting",
    "voiced",
    "concerns",
    "potential",
    "consultation",
    "trask",
    "exploration",
    "site",
    "resources",
    "hants",
    "n",
    "s",
    "discuss",
    "lack",
    "millet",
    "brook",
    "local",
    "hasn’t",
    "consulted",
    "request",
    "proposals",
    "companies",
    "natural",
    "speakers",
    "municipal",
    "canadian",
    "nova"
  ],
  "summary": "A Hants County, N.S., resident who planned a weekend meeting to discuss uranium mining in the area says residents in attendance voiced concerns about potential environmental and health harms and a lack of government consultation.\nSarah Trask, who lives in the community of Vaughan, N.S., said in an interview Monday that the community meeting to discuss proposed uranium mining in nearby Millet Brook filled a local fire station Saturday.\nSome of these speakers voiced concerns that uranium exploration could result in potential water contamination or exposure to radon gas and radioactive dust.\nThe Nova Scotia Assembly of Mi’kmaw Chiefs has repeatedly voiced concerns about government’s lack of consultation with its communities as Nova Scotia pushes to develop natural resources.\nPremier Tim Houston has said the legislative changes were needed to help the province withstand economic challenges from American tariffs.",
  "scraped_at": "2025-06-04T19:14:51.389261"
},
{
  "index": 8,
  "title": "#8 Historic Grand Banks schooner's future being assessed at Lunenburg, N.S., shipyard",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/02/historic-grand-banks-schooners-future-being-assessed-at-lunenburg-n-s-shipyard/",
  "publish_date": "2025-06-02T00:00:00",
  "keywords": [
    "grand",
    "banks",
    "schooner’s",
    "future",
    "assessed",
    "lunenburg",
    "shipyard",
    "historic",
    "n",
    "s",
    "vessel",
    "museum",
    "schooner",
    "schooners",
    "theresa",
    "connor",
    "department",
    "it’s",
    "assessment",
    "determine",
    "options",
    "that’s",
    "fisheries",
    "atlantic",
    "spokesman",
    "work",
    "public",
    "built",
    "remaining",
    "fishing",
    "constructed",
    "fleet",
    "owner",
    "amazing",
    "canadian"
  ],
  "summary": "HALIFAX — An assessment has been ordered to determine the options for a historic schooner that’s been berthed at the site of the Fisheries Museum of the Atlantic in Lunenburg, N.S.\n“This will help us better understand the vessel’s condition and what work may be required,” he wrote in an email.\nAccording to museum records, Theresa E. Connor is one of Canada’s oldest schooners, and the last to dory fish the Grand Banks out of the port of Lunenburg.\n“It’s absolutely amazing, it gives you goosebumps if you’re into that sort of thing,” he said.\n“It would be an amazing exhibit, and it would cost a lot less than building a new schooner,” he said.",
  "scraped_at": "2025-06-04T19:14:53.317981"
},
{
  "index": 1,
  "title": "#1 As hydrogen hype meets reality in Newfoundland, companies eye markets closer to home",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/04/as-hydrogen-hype-meets-reality-in-newfoundland-companies-eye-markets-closer-to-home/",
  "publish_date": "2025-06-04T00:00:00",
  "keywords": [
    "meets",
    "reality",
    "eye",
    "markets",
    "closer",
    "hydrogen",
    "newfoundland",
    "companies",
    "hype",
    "energy",
    "power",
    "global",
    "green",
    "industry",
    "labrador",
    "wind",
    "it’s",
    "told",
    "buyers",
    "local",
    "grid",
    "renewable",
    "murphy",
    "atlantic",
    "2022",
    "world",
    "povisils",
    "company",
    "ammonia",
    "st",
    "john’s",
    "n",
    "l",
    "projects",
    "united"
  ],
  "summary": "ST. JOHN’S — The global green hydrogen industry is lagging behind its own hype, but executives from six companies vying to build wind-powered hydrogen operations in Newfoundland and Labrador say it’s too soon give up.\nAnd there may be a chance to supply wind power to the local grid in Newfoundland and Labrador.\nThe race to launch a green hydrogen industry in Canada’s easternmost province began in earnest in 2022 when Olaf Scholz, the former chancellor of Germany, visited western Newfoundland in 2022.\nHe signed a memorandum of understanding with former prime minister Justin Trudeau to develop a transatlantic green hydrogen corridor, with the first shipments hoped to begin this year.\nThe players that are left are the ones that are serious and committed.” The local green energy industry will ultimately rely largely on exports, Povisils said.",
  "scraped_at": "2025-06-04T19:14:53.770543"
},
{
  "index": 5,
  "title": "#5 Newfoundland voters concerned after apparent voter mistakes void hundreds of ballots",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/03/newfoundland-voters-concerned-after-apparent-voter-mistakes-void-hundreds-of-ballots/",
  "publish_date": "2025-06-03T00:00:00",
  "keywords": [
    "concerned",
    "apparent",
    "mistakes",
    "void",
    "hundreds",
    "ballots",
    "newfoundland",
    "voters",
    "voter",
    "elections",
    "canada",
    "ballot",
    "instructions",
    "recount",
    "riding",
    "mark",
    "report",
    "rejected",
    "barnett",
    "rowe",
    "election",
    "terra",
    "nova-the",
    "peninsulas",
    "votes",
    "liberal",
    "ridings",
    "st",
    "john’s",
    "judicial",
    "marked",
    "wrong",
    "didn’t",
    "receive",
    "advance"
  ],
  "summary": "In the ridings of Central Newfoundland and Long Range Mountains, the average is age 49, according to Elections Canada.\nAmanda Bittner, a political science professor at Memorial University in St. John’s, said anything Elections Canada can do to decrease the confusion around voting is good.\n“That speaks to a gap between voter understanding of what to do and Elections Canada processes.” “Fortunately, Elections Canada takes voter turnout very seriously, and I am sure they have already made note of this issue and are working on tweaking their processes for next time,” she added.\nThe 62-year-old also hopes Elections Canada will try to figure out why so many ballots were cast incorrectly.\nHowever, she hopes Elections Canada will take note of what happened and ensure it won’t happen again.",
  "scraped_at": "2025-06-04T19:14:54.231342"
},
{
  "index": 3,
  "title": "#3 Quebec, Newfoundland energy touts Canadian independence to Trump: Hydro‑Québec CEO",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/03/quebec-newfoundland-energy-touts-canadian-independence-to-trump-hydro%e2%80%91quebec-ceo/",
  "publish_date": "2025-06-03T00:00:00",
  "keywords": [
    "quebec",
    "touts",
    "canadian",
    "independence",
    "trump",
    "ceo",
    "newfoundland",
    "energy",
    "hydro",
    "québec",
    "labrador",
    "deal",
    "sabia",
    "williams",
    "canada",
    "end",
    "churchill",
    "long",
    "st",
    "john’s",
    "chief",
    "executive",
    "signal",
    "united",
    "states",
    "n",
    "l",
    "draft",
    "told",
    "labrador’s",
    "industry",
    "economic",
    "it’s",
    "future",
    "canada’s"
  ],
  "summary": "It’s about building now to secure Canada’s energy future.” Sabia was speaking to the crowd at a conference held by Energy N.L., Newfoundland and Labrador’s energy industry association.\nHe was joined on stage by Jennifer Williams, president and chief executive of Newfoundland and Labrador Hydro.\nThe new arrangement would end the contentious deal 16 years early and see Hydro‑Québec pay for more power while developing new projects with Newfoundland and Labrador Hydro along the Churchill River.\nSome in Newfoundland and Labrador have also wondered if Hydro‑Québec can be trusted and whether the province will truly get enough value for its resources.\nNewfoundland and Labrador expects to be carrying a net debt of $19.4 billion by the end of the current fiscal year.",
  "scraped_at": "2025-06-04T19:14:57.456267"
},
{
  "index": 4,
  "title": "#4 Judge orders rethink of preservation plan for endangered piping plovers on East Coast",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/06/03/judge-orders-rethink-of-preservation-plan-for-endangered-piping-plovers-on-east-coast/",
  "publish_date": "2025-06-03T00:00:00",
  "keywords": [
    "orders",
    "rethink",
    "preservation",
    "endangered",
    "east",
    "coast",
    "plan",
    "judge",
    "piping",
    "plovers",
    "habitat",
    "beaches",
    "federal",
    "critical",
    "minister",
    "plover",
    "clear",
    "decision",
    "southcott",
    "recovery",
    "concerns",
    "raised",
    "environmental",
    "birds",
    "entire",
    "system",
    "wrote",
    "provide",
    "response",
    "2022",
    "applicants",
    "groups",
    "protected",
    "ottawa",
    "strategy"
  ],
  "summary": "HALIFAX — A federal judge has ordered Ottawa to rethink its strategy to preserve an endangered shorebird.\nPiping plovers are small shorebirds that nest primarily on sand, gravel or cobblestone beaches.\n“The applicants argued that without a biology degree, the beachgoer would be unable to understand whether any particular part of the beach is indeed critical habitat,” wrote the judge.\nDuring the trial, the federal government responded that their new system was more geographically precise and was defining critical habitat in clear, scientific terms.\nThere was also testimony from federal experts arguing that the wording of the recovery plan for the birds was actually intended to identify entire beaches as plover critical habitat.",
  "scraped_at": "2025-06-04T19:14:57.912239"
}
]