[
{
  "index": 10,
  "title": "#10 P.E.I. premier asks Ottawa for timeline on bridge and ferry toll reductions",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/p-e-i-premier-asks-federal-government-for-timeline-on-bridge-ferry-toll-reductions/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "p",
    "premier",
    "asks",
    "ottawa",
    "toll",
    "reductions",
    "bridge",
    "ferry",
    "timeline",
    "tolls",
    "trade",
    "million",
    "federal",
    "ferries",
    "confederation",
    "northumberland",
    "transport",
    "increasing",
    "barriers",
    "strait",
    "crossing",
    "company",
    "n",
    "island",
    "reduce",
    "interprovincial",
    "services",
    "canada",
    "liu",
    "s",
    "prince",
    "edward",
    "lantz",
    "letter",
    "significant"
  ],
  "summary": "Rob Lantz said in a letter to federal Transport Minister Chrystia Freeland that bridge and ferry tolls are seen as a significant trade barrier, increasing everyday costs.\nThe Confederation Bridge stretches across 12.9-kilometres, and is billed as Canada’s longest flyover.\nTransport Canada spokeswoman Sau Sau Liu said in an email the annual traffic on the Confederation Bridge is about 990,000 vehicles.\nNorthumberland Ferries is headquartered in Charlottetown and operates ferry services between the three Maritime provinces and Maine.\n“That’s why we’re making the Confederation Bridge, Northumberland and Marine Atlantic, and the Coopérative de Transport Maritime et Aérien Ferries more affordable.",
  "scraped_at": "2025-05-28T16:38:29.709339"
},
{
  "index": 2,
  "title": "#2 Halifax says it is closing one of the five remaining designated homeless encampments",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/halifax-says-it-is-closing-one-of-the-five-remaining-designated-homeless-encampments/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "designated",
    "halifax",
    "remaining",
    "homeless",
    "closing",
    "encampments",
    "encampment",
    "geary",
    "street",
    "sites",
    "tents",
    "site",
    "municipality",
    "dartmouth",
    "chauvin",
    "housing",
    "canadian",
    "press",
    "regional",
    "statement",
    "morning",
    "green",
    "space",
    "longer",
    "sheltering",
    "22",
    "relocate",
    "max",
    "halifax’s",
    "director",
    "homelessness",
    "consistently",
    "lowest",
    "staff",
    "observed"
  ],
  "summary": "HALIFAX — Halifax Regional Municipality is closing one of its five remaining homeless encampment sites.\nMax Chauvin, Halifax’s director of housing and homelessness, says the Geary Street site has consistently had the lowest use among the designated encampments.\nAs of Friday, Halifax staff observed four tents at the Geary Street site, and 47 tents and four trailers across the municipality’s four other designated encampment locations, he says.\nChauvin says in the coming days, the residents sleeping at the Geary Street site will be offered resources and support to move to a shelter, temporary housing or one of the remaining designated encampment sites.\nFour designated homeless encampment sites will remain open; three in Halifax and one in Dartmouth.",
  "scraped_at": "2025-05-28T16:38:30.425081"
},
{
  "index": 4,
  "title": "#4 Landowners can say no to uranium exploration on their properties: Deputy",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/nova-scotia-landowners-can-say-no-to-uranium-exploration-on-their-properties-deputy/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "properties",
    "exploration",
    "uranium",
    "property",
    "communities",
    "told",
    "site",
    "county",
    "province",
    "nova",
    "minister",
    "natural",
    "resources",
    "private",
    "landowners",
    "owners",
    "land",
    "list",
    "sites",
    "premier",
    "houston",
    "economy",
    "canadian",
    "thriving",
    "concerns",
    "scotia’s",
    "deputy",
    "identified",
    "potential",
    "karen",
    "gatien",
    "reporters",
    "letters",
    "selected",
    "areas"
  ],
  "summary": "Nova Scotia’s deputy minister of natural resources says private landowners whose property has been identified for potential uranium exploration can say no.\nKaren Gatien told reporters Tuesday that letters are being sent to property owners in three selected areas, and the government hopes there will at least be conversations about possible exploration.\nThe provincial government added uranium to its list of priority critical minerals earlier this month and issued a request for exploration proposals at three sites it says have known deposits of the heavy metal.\nEach of the three sites is on private land, and Natural Resources Minister Tory Rushton has said the government would begin talks with the landowners about possible exploration.\nThere were fishing communities, farming communities, forestry communities, mining communities,” Houston said.",
  "scraped_at": "2025-05-28T16:38:30.855641"
},
{
  "index": 6,
  "title": "#6 RCMP narrows down timeline of Sullivan children disappearance; asks for public videos",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/rcmp-narrows-down-timeline-of-sullivan-children-disappearance-asks-for-public-videos/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "release",
    "rcmp",
    "children",
    "sullivan",
    "timeline",
    "missing",
    "jack",
    "00",
    "m",
    "martell",
    "confirmed",
    "public",
    "nova",
    "lilly",
    "family",
    "we’ve",
    "major",
    "unit",
    "gairloch",
    "road",
    "12",
    "p",
    "press",
    "disappearance",
    "place",
    "days",
    "search",
    "nearby",
    "alive",
    "asked",
    "investigators",
    "rural",
    "scotia",
    "community",
    "month"
  ],
  "summary": "Investigators said they have confirmed the last time two missing children were seen in public in a rural Nova Scotia community.\nLilly, 6, and Jack Sullivan, 4, have been missing for almost a month, and now the RCMP said they have a timeline of when they were last seen by other people outside of their immediate family.\nSandy Matharu, Northeast Nova RCMP Major Crime Unit.\nThe Mounties add in the press release that they are “committed to exploring all possibilities” surrounding the children’s disappearance.\nSince the beginning, Martell has asked the RCMP to look into whether the two were abducted, but police have said there is no evidence of that.",
  "scraped_at": "2025-05-28T16:38:31.267504"
},
{
  "index": 7,
  "title": "#7 Moscovitch's drama 'Red Like Fruit' explores power and memory in post-#MeToo era",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/moscovitchs-drama-red-like-fruit-explores-power-and-memory-in-post-metoo-era/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "drama",
    "explores",
    "power",
    "memory",
    "post",
    "metoo",
    "era",
    "red",
    "fruit",
    "moscovitch’s",
    "moscovitch",
    "it’s",
    "theatre",
    "sexual",
    "misconduct",
    "soulpepper",
    "schultz",
    "experiences",
    "mengesha",
    "she’s",
    "toronto",
    "work",
    "plays",
    "allegations",
    "artistic",
    "director",
    "past",
    "things",
    "barry",
    "you’re",
    "real",
    "life",
    "there’s",
    "significance",
    "playwright"
  ],
  "summary": "There’s rich significance, she suggests, in bringing her latest meditation on gender and power to a renowned Toronto theatre company once inextricably linked to allegations of sexual misconduct.\nThe celebrated playwright points out that “Red Like Fruit” hits Soulpepper several years after its co-founder and artistic director Albert Schultz resigned amid allegations of impropriety dating back years.\n“They’re trying to combat their own legacy,” Moscovitch says of being presented by Soulpepper, in collaboration with the Luminato Festival.\nSuch familiarity is especially handy in directing “Red Like Fruit,” he says, recalling multiple conversations with Moscovitch about her own eureka moments over past encounters.\nIs that trauma or is that experience?” “Red Like Fruit” begins with a preview Wednesday and opens Thursday.",
  "scraped_at": "2025-05-28T16:38:34.382185"
},
{
  "index": 1,
  "title": "#1 Province says not enough evidence for charges in origins of 2023 Halifax wildfire",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/province-says-not-enough-evidence-for-charges-in-origins-of-2023-halifax-wildfire/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "province",
    "charges",
    "evidence",
    "halifax",
    "wildfire",
    "origins",
    "2023",
    "department",
    "natural",
    "resources",
    "release",
    "lay",
    "forests",
    "act",
    "determined",
    "canadian",
    "press",
    "nova",
    "scotia",
    "opted",
    "laying",
    "relation",
    "western",
    "suburbs",
    "today",
    "isn’t",
    "sufficient",
    "secure",
    "conviction",
    "high",
    "bar",
    "court",
    "cases",
    "rcmp",
    "investigation"
  ],
  "summary": "HALIFAX — The Nova Scotia government has opted against laying charges in relation to the origins of a 2023 wildfire in the western suburbs of Halifax.\nThe Department of Natural Resources says in a release today that it had up to two years to lay charges under the Forests Act, but it had determined there isn’t sufficient evidence to secure a conviction.\nIn the release, the department also says there is a “high bar” for what can be used as evidence in court in these cases.\nLast December, an RCMP investigation determined no criminality in the cause of the wildfire, and the file was passed to the province.\nLast August, Natural Resources Minister Tory Rushton said investigators knew the location of the original fire but needed more evidence to lay charges.",
  "scraped_at": "2025-05-28T16:38:35.840722"
},
{
  "index": 3,
  "title": "#3 Archeologist who unraveled the story of North America's only Viking site has died",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/archeologist-who-unraveled-the-story-of-north-americas-only-viking-site-has-died/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "unraveled",
    "america’s",
    "viking",
    "site",
    "died",
    "archeologist",
    "north",
    "wallace",
    "ferguson",
    "l’anse",
    "aux",
    "meadows",
    "hospital",
    "celebrated",
    "swedish-canadian",
    "helped",
    "unravel",
    "vikings",
    "acknowledged",
    "norse",
    "america",
    "birgitta",
    "discovered",
    "evidence",
    "leif",
    "eriksson’s",
    "vinland",
    "briefly",
    "established",
    "tip",
    "newfoundland’s",
    "great",
    "northern",
    "peninsula",
    "robert"
  ],
  "summary": "A celebrated Swedish-Canadian archeologist who helped unravel the story of the Vikings at the only acknowledged Norse site in North America has died.\nBirgitta Wallace Ferguson discovered evidence that Leif Eriksson’s Vinland was briefly established at L’Anse aux Meadows, at the tip of Newfoundland’s Great Northern Peninsula.\nRobert Ferguson, her husband and fellow archeologist, says she was passionately devoted to her work and the L’Anse aux Meadows site, where she felt a deep connection with the local community.\nAdjunct archeology professor Shannon Lewis-Simpson says though Wallace Ferguson was a titan in her field, she was known for being modest, kind and generous with her time and expertise.\nWallace died last week in Halifax while in hospital.",
  "scraped_at": "2025-05-28T16:38:36.259501"
},
{
  "index": 9,
  "title": "#9 Ward scores winner, Tigers advance to Memorial Cup final with 3-1 win over Knights",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/ward-scores-winner-tigers-advance-to-memorial-cup-final-with-3-1-win-over-knights/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "scores",
    "winner",
    "advance",
    "tigers",
    "knights",
    "memorial",
    "cup",
    "final",
    "3-1",
    "win",
    "ward",
    "london",
    "period",
    "rimouski",
    "medicine",
    "hat",
    "moncton",
    "mckenna",
    "net",
    "play",
    "meneghin",
    "neutens",
    "ritchie",
    "goal",
    "hockey",
    "league",
    "elliott",
    "minutes",
    "puck",
    "scored",
    "35",
    "shots",
    "night",
    "wildcats",
    "océanic"
  ],
  "summary": "RIMOUSKI — Mathew Ward scored the winner at 1:17 of the third period and Harrison Meneghin stopped 35 shots as the Medicine Hat Tigers advanced to the Memorial Cup final with a 3-1 win over the London Knights on Tuesday night.\nEthan Neutens also scored while Ryder Ritchie added an empty-net goal for Medicine Hat (3-0), which won the Western Hockey League.\nThe Tigers won 3-1 over Moncton and claimed a 5-4 victory against Rimouski earlier in the round robin at Colisée Financière Sun Life.\nLondon contained Tigers phenom Gavin McKenna — the projected top pick in the 2026 NHL draft — much of the night.\nLondon dominated most of the opening 20 minutes, with a 10-7 edge in shots, but Medicine Hat responded in the second.",
  "scraped_at": "2025-05-28T16:38:37.003413"
},
{
  "index": 5,
  "title": "#5 Nova Scotia RCMP confirm children were seen in public a day before they disappeared",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/nova-scotia-rcmp-confirm-children-were-seen-in-public-a-day-before-they-disappeared/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "confirm",
    "disappeared",
    "rcmp",
    "children",
    "public",
    "nova",
    "scotia",
    "day",
    "search",
    "confirmed",
    "missing",
    "lilly",
    "jack",
    "video",
    "footage",
    "ground",
    "halifax",
    "family",
    "members",
    "reported",
    "sullivan",
    "lansdowne",
    "station",
    "details",
    "we’ve",
    "matharu",
    "statement",
    "area",
    "investigation",
    "investigators",
    "road",
    "family’s",
    "located",
    "noon",
    "28"
  ],
  "summary": "HALIFAX — RCMP in northeastern Nova Scotia confirmed that two children who disappeared almost four weeks ago were last seen in public with family members on May 1 — the day before they were reported missing.\n“Based on the details we’ve gathered so far, we’ve confirmed that Lilly and Jack were observed in public with family members on the afternoon of May 1,” Nova Scotia RCMP major crime unit Cpl.\nPolice said in the statement they are asking the public for more video footage from the area to help with their investigation.\nPolice have repeatedly said there is no evidence to suggest the children were abducted.\nOn May 7, the search was scaled back as the RCMP announced there was little chance the siblings could have survived in the woods for that long.",
  "scraped_at": "2025-05-28T16:38:37.424479"
},
{
  "index": 8,
  "title": "#8 Meneghin shines, Tigers advance to Memorial Cup final with 3-1 win over Knights",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/meneghin-shines-tigers-advance-to-memorial-cup-final-with-3-1-win-over-knights/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "shines",
    "advance",
    "meneghin",
    "knights",
    "tigers",
    "memorial",
    "cup",
    "final",
    "3-1",
    "win",
    "london",
    "period",
    "rimouski",
    "ward",
    "play",
    "desjardins",
    "game",
    "medicine",
    "hat",
    "net",
    "moncton",
    "neutens",
    "mckenna",
    "played",
    "35",
    "night",
    "tonight",
    "semifinal",
    "hockey",
    "league",
    "power",
    "puck",
    "guys",
    "bonk",
    "didn’t"
  ],
  "summary": "Harrison Meneghin stopped 35 shots as the Medicine Hat Tigers advanced to the Memorial Cup final with a 3-1 win over the London Knights on Tuesday night.\nMedicine Hat awaits the winner of that semifinal showdown for Sunday’s final, seeking a third Memorial Cup in its fourth championship appearance.\nMeneghin, meanwhile, kept London from pulling away during a dominant opening 20 minutes from the Knights.\nDickinson almost put the Knights ahead twice on separate rushes up the ice later in the period, but Meneghin shut the door.\nThe three key contributors — Meneghin, Ward and Neutens — all played for different teams a season ago.",
  "scraped_at": "2025-05-28T16:38:38.004814"
}
]