[
{
  "index": 6,
  "title": "#6 Halifax only paying for demolition of fire-damaged building at Bloomfield, city now says",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/04/02/taxpayers-on-the-hook-for-demolition-of-bloomfield-site/",
  "publish_date": "2025-04-02T00:00:00",
  "keywords": [
    "taxpayers",
    "footing",
    "bill",
    "demolition",
    "halifax",
    "site",
    "bloomfield",
    "municipality",
    "buildings",
    "statement",
    "issued",
    "citynews",
    "cost",
    "damaged",
    "2025",
    "hrfe",
    "safety",
    "fencing",
    "security",
    "building",
    "plans",
    "property",
    "owner",
    "regional",
    "clarification",
    "information",
    "provided",
    "vacant",
    "school",
    "municipal",
    "spokesperson",
    "told",
    "covering",
    "includes",
    "derelict"
  ],
  "summary": "The Halifax Regional Municipality has issued a clarification to information provided to CityNews Halifax regarding the demolition of the vacant Bloomfield school site.\nOn Wednesday, a municipal spokesperson told CityNews that the municipality would be covering the cost of demolition at the site, which includes three derelict buildings and is owned by BANC Group.\nIn a statement Thursday, the municipality now says there was a miscommunication, and Halifax will only be footing the bill for the demolition of one of the buildings that was significantly damaged by fire in February.\n“Following its initial response to the fire at one of the three buildings at the Bloomfield site on Feb. 16, 2025, Halifax RegionalFire & Emergency (HRFE), pursuant to the Fire Safety Act, installed temporary fencing and established security at the site for public safety,” the municipality’s statement reads.\nThe municipality now says a demolition permit issued on March 11, 2025, is for the two remaining structures, and the property owner will be responsible for any costs associated with that work.",
  "scraped_at": "2025-04-03T20:57:51.088596"
},
{
  "index": 7,
  "title": "#7 Driver faces multiple charges following collision in Spryfield",
  "authors": [
    "Chris Halef"
  ],
  "url": "https://halifax.citynews.ca/2025/04/02/driver-faces-multiple-charges-following-collision-in-spryfield/",
  "publish_date": "2025-04-02T00:00:00",
  "keywords": [
    "spryfrield",
    "results",
    "charges",
    "crash",
    "driver",
    "ehs",
    "believed",
    "non-life-threatening",
    "injuries",
    "passenger",
    "operation",
    "conveyance",
    "bodily",
    "harm",
    "failure",
    "man",
    "faces",
    "multiple",
    "connection",
    "collision",
    "spryfield",
    "roughly",
    "p",
    "m",
    "officers",
    "responded",
    "two-vehicle",
    "500",
    "block",
    "sambro",
    "road",
    "51-year-old",
    "woman",
    "vehicles",
    "transported"
  ],
  "summary": "A man faces multiple charges in connection to a collision in Spryfield on Monday.\nAt roughly 1 p.m., officers responded to a two-vehicle crash in the 500 block of Old Sambro Road.\nShe was transported to hospital by EHS with what are believed to be serious but non-life-threatening injuries.\nPolice said the driver and passenger of the other vehicle were seen leaving the scene on foot and fleeing into the nearby woods.\nThe passenger was released without charges and turned over to EHS for treatment of what are believed to be non-life-threatening injuries.",
  "scraped_at": "2025-04-03T20:57:52.944495"
},
{
  "index": 2,
  "title": "#2 Halifax police seek SUV driver after youth struck in crosswalk",
  "authors": [
    "Shelli Summers"
  ],
  "url": "https://halifax.citynews.ca/2025/04/03/halifax-police-seek-suv-driver-after-youth-struck-in-crosswalk/",
  "publish_date": "2025-04-03T00:00:00",
  "keywords": [
    "hit",
    "youth",
    "vehicle",
    "walking",
    "crosswalk",
    "suv",
    "halifax",
    "public’s",
    "search",
    "believed",
    "involved",
    "collision",
    "pedestrian",
    "rcmp",
    "local",
    "received",
    "minor",
    "injuries",
    "struck",
    "cole",
    "harbour",
    "road",
    "marked",
    "illuminated",
    "20",
    "m",
    "yesterday",
    "investigators",
    "red",
    "driver",
    "white",
    "woman",
    "50s",
    "stopped",
    "drove"
  ],
  "summary": "Halifax police are asking for the public’s help as they search for an SUV believed to be involved in a collision with a pedestrian.\nRCMP say a local youth received minor injuries after they were struck by a vehicle on Cole Harbour Road while walking across a marked, illuminated crosswalk at 7:20 a.m. yesterday.\nInvestigators described the vehicle as a red SUV.\nThey say the driver was a white woman in her 50s who stopped to ask if the youth was OK, then drove off.\nAnyone with information is asked to reach out to police or to CrimeStoppers.",
  "scraped_at": "2025-04-03T20:57:53.464001"
},
{
  "index": 3,
  "title": "#3 Houston says thousands in N.S. still affected by tariff uncertainty",
  "authors": [
    "Shelli Summers"
  ],
  "url": "https://halifax.citynews.ca/2025/04/03/houston-says-thousands-in-n-s-still-affected-by-tariff-uncertainty/",
  "publish_date": "2025-04-03T00:00:00",
  "keywords": [
    "responds",
    "tariffs",
    "houston",
    "trump",
    "latest",
    "s",
    "nova",
    "premier",
    "canada",
    "reciprocal",
    "appears",
    "thousands",
    "scotians",
    "impact",
    "canadians",
    "continue",
    "prime",
    "minister",
    "carney",
    "mexico",
    "subject",
    "tariff",
    "charge",
    "meeting",
    "scotia’s",
    "released",
    "statement",
    "night",
    "hit",
    "worst-case",
    "scenario",
    "impacted",
    "recognize",
    "buildup",
    "moment"
  ],
  "summary": "Nova Scotia’s premier released a statement Tuesday night saying that while it appears Canada may not have been hit with the worst-case scenario on tariffs, thousands of Nova Scotians will still be impacted.\nHouston also thanked Prime Minister Mark Carney for his leadership, saying this is not an easy time for the country.\nThe latest on Trump tariffs A White House fact sheet clarifies that Canada and Mexico are not subject to the reciprocal tariff order outlined by U.S. President Trump.\nCanada and Mexico are not subject to reciprocal tariffs, continuing USMCA exemptions, according to various reports.\nThe prime minister is meeting with Canada’s premiers on Thursday to discuss the latest tariffs.",
  "scraped_at": "2025-04-03T20:57:55.231401"
},
{
  "index": 10,
  "title": "#10 Mooseheads fall in game 3, Voltigeurs breathe new life into series",
  "authors": [
    "Coulson Ward"
  ],
  "url": "https://halifax.citynews.ca/2025/04/01/mooseheads-fall-in-game-3-voltigeurs-breathe-new-life-into-series/",
  "publish_date": "2025-04-01T00:00:00",
  "keywords": [
    "fall",
    "breathe",
    "life",
    "voltigeurs",
    "mooseheads",
    "series",
    "game",
    "drummondville",
    "lead",
    "woodworth",
    "scored",
    "win",
    "star",
    "herd",
    "luke",
    "lone",
    "goal",
    "quinn",
    "kennedy",
    "left",
    "louis-félix",
    "charrois",
    "scotiabank",
    "centre",
    "earned",
    "action",
    "claimed",
    "halifax",
    "defeating",
    "4-1",
    "bridgewater",
    "native",
    "period",
    "giving",
    "early"
  ],
  "summary": "The Drummondville Voltigeurs claimed game three against the Halifax Mooseheads, defeating the Herd 4-1 Bridgewater native Luke Woodworth scored the lone goal of the first period giving Drummondville the early lead.\nWoodworth scored his second of the night in the third, doubling the Voltigeurs lead.\nthe Mooseheads answered back as Quinn Kennedy scored off a pass from the point by Brady Schultz.\nWith the loss the Herd still hold a 2-1 series lead over Drummondville in the best of seven series.\nThe two teams will return to action tomorrow, Apr 2 as the Mooseheads host game four at the Scotiabank Centre.",
  "scraped_at": "2025-04-03T20:57:56.689801"
},
{
  "index": 8,
  "title": "#8 Africville reunion shooting added to unsolved crime rewards program",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/04/02/africville-reunion-shooting-added-to-unsolved-crime-rewards-program/",
  "publish_date": "2025-04-02T00:00:00",
  "keywords": [
    "crime",
    "shooting",
    "africville",
    "program",
    "added",
    "rewards",
    "unsolved",
    "2024",
    "reunion",
    "information",
    "community",
    "reward",
    "annual",
    "happened",
    "celebrate",
    "historic",
    "halifax",
    "province",
    "case",
    "major",
    "crimes",
    "media",
    "provincial",
    "offering",
    "large",
    "leading",
    "arrest",
    "conviction",
    "involved",
    "year’s",
    "27",
    "hundreds",
    "gathered",
    "41st",
    "national"
  ],
  "summary": "The provincial government is now offering a large financial reward for information leading to the arrest and conviction of people involved in last year’s shooting at the Africville annual reunion.\nThe shooting happened on July 27, 2024, when hundreds of people had gathered to celebrate the 41st annual reunion at the national historic site in the north end of Halifax.\nFive young people were injured in the shooting that happened around 10:00 p.m., according to the province.\nThe case being added to the Rewards for Major Unsolved Crimes Program means a reward of up to $150,000 is available.\nAnyone with information should call the Rewards for Major Unsolved Crimes Program at 1-888-710-9090.",
  "scraped_at": "2025-04-03T20:57:57.243270"
},
{
  "index": 1,
  "title": "#1 Additional funding announced to support gender-based violence initiatives",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/04/03/funding-announced-to-support-gender-based-violence-initiatives/",
  "publish_date": "2025-04-03T00:00:00",
  "keywords": [
    "feds",
    "team",
    "fund",
    "gender",
    "province",
    "violence",
    "funding",
    "nova",
    "projects",
    "gender-based",
    "women",
    "scotia",
    "million",
    "communities",
    "community",
    "national",
    "leah",
    "martin",
    "minister",
    "responsible",
    "advisory",
    "council",
    "status",
    "support",
    "inquiry",
    "programs",
    "ywca",
    "organizations",
    "fighting",
    "domestic",
    "agreement",
    "federal",
    "governments",
    "28",
    "10-year"
  ],
  "summary": "Community organizations fighting domestic violence across the province are getting funding for a second year through an agreement between the Nova Scotia and federal governments.\nGovernment says $5.1 million is going to 28 projects through the 10-year National Action Plan to End Gender-Based Violence.\nThis comes after the government-funded programs run by the YWCA Halifax for survivors of gender-based violence.\nSeveral funding announcements have been made as of late on intimate partner violence and other issues disproportionately affecting women in the province.\nThis time the government is investing $2.95 million over three years in two community projects.",
  "scraped_at": "2025-04-03T20:57:57.977226"
},
{
  "index": 5,
  "title": "#5 Voltigeurs defeat Mooseheads, tie playoff series",
  "authors": [
    "Coulson Ward"
  ],
  "url": "https://halifax.citynews.ca/2025/04/02/voltigeurs-defeat-mooseheads-tie-playoff-series/",
  "publish_date": "2025-04-02T00:00:00",
  "keywords": [
    "defeat",
    "tie",
    "playoff",
    "voltigeurs",
    "series",
    "mooseheads",
    "gauthier",
    "ethan",
    "game",
    "drummondville",
    "woodworth",
    "pass",
    "lead",
    "loss",
    "halifax",
    "scotiabank",
    "centre",
    "scoring",
    "period",
    "luke",
    "sending",
    "net",
    "added",
    "goal",
    "jacob",
    "steinman",
    "star",
    "hat",
    "trick",
    "powered",
    "3-1",
    "victory",
    "evening",
    "opened",
    "2-1"
  ],
  "summary": "An Ethan Gauthier hat trick powered the Drummondville Voltigeurs to a 3-1 victory over the Halifax Mooseheads at the Scotiabank Centre on Wednesday evening.\nThe Voltigeurs opened the scoring in the second period as Ethan Gauthier and Luke Woodworth found themselves on a 2-1 opportunity, Woodworth sending a pass to Gauthier who sniped it into the Mooseheads net.\nEthan Gauthier restored Drummondville’s two goal lead, scoring his third of the night, sniping a pass from Jesse Allecia past Jacob Steinman as the Voltigeurs claimed game four of the seven game series.\nDrummondville forwards Ethan Gauthier and Luke Woodworth were awarded second and third star respectively.\nGame 5 will take place at the Scotiabank Centre on Friday, Apr 4 as both teams look to take the series lead heading back to Drummondville.",
  "scraped_at": "2025-04-03T20:57:59.155262"
},
{
  "index": 4,
  "title": "#4 Province spending millions to launch new doctoral psychology program",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/04/03/province-spending-millions-to-launch-new-doctoral-psychology-program/",
  "publish_date": "2025-04-03T00:00:00",
  "keywords": [
    "halifax",
    "university",
    "psychology",
    "program",
    "doctoral",
    "coming",
    "mental",
    "health",
    "services",
    "clinic",
    "million",
    "canada",
    "access",
    "care",
    "report",
    "professionals",
    "training",
    "nova",
    "scotia",
    "young",
    "department",
    "addictions",
    "costs",
    "country",
    "needed",
    "can’t",
    "provincial",
    "announced",
    "millions",
    "dollars",
    "funding",
    "train",
    "addiction",
    "local",
    "province"
  ],
  "summary": "The provincial government announced millions of dollars in funding to train more mental health and addiction professionals at a local university.\nThe province says a new doctoral psychology program and training clinic, the first of its kind in Nova Scotia, will be coming to Mount Saint Vicent University — focusing on the needs of children and young people.\nAddictions and Mental Health Minister Brian Comer says there is a need for more child psychologists in Nova Scotia and across the country.\nMSVU president Joël Dickinson says the university is leveraging its expertise in psychology to expand much needed services.\nMental health access lacking in Canada Inability to get needed mental health care is a reality facing many people in this country, according to The State of Mental Health in Canada 2024, a report released by the Canadian Mental Health Association.",
  "scraped_at": "2025-04-03T20:58:00.241393"
},
{
  "index": 9,
  "title": "#9 Halifax wildfires: Residents of city's western suburbs want more escape routes",
  "authors": [
    "News Staff"
  ],
  "url": "https://halifax.citynews.ca/2025/04/02/halifax-wildfires-residents-of-citys-western-suburbs-want-more-escape-routes/",
  "publish_date": "2025-04-02T00:00:00",
  "keywords": [
    "escape",
    "routes",
    "halifax",
    "residents",
    "suburbs",
    "city’s",
    "wildfires",
    "western",
    "emergency",
    "road",
    "plan",
    "hills",
    "davies",
    "main",
    "water",
    "interview",
    "council",
    "it’s",
    "exits",
    "fires",
    "area",
    "email",
    "flee",
    "2023",
    "buckland",
    "exit",
    "existing",
    "regional",
    "isn’t",
    "white",
    "hammonds",
    "plains",
    "evacuation",
    "bring",
    "office"
  ],
  "summary": "Almost two years after wildfires destroyed 200 structures, including 151 homes, in the western suburbs of Halifax, residents are anxious about the city’s slow progress in creating more ways for them to flee if the flames return.\nBuckland and other residents in nearby communities who were interviewed by The Canadian Press say further changes are needed.\nShe predicted that if fires reached her area, both exits would likely be blocked by blazes, and the main road would be gridlocked.\nDavies contacted the Halifax regional council for education, which told her they’d bring her suggestions forward to Halifax’s Emergency Management Office.\nThe council sent letters to the city’s emergency office last January, but Davies said she’s had no response to her ideas.",
  "scraped_at": "2025-04-03T20:58:02.134552"
}
]