[
{
  "index": 1,
  "title": "#1 No charges to be laid as N.S. marks two years since Halifax-area wildfire",
  "authors": [
    "Chris Halef"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/no-charges-to-be-laid-as-n-s-marks-two-years-since-halifax-area-wildfire/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "n",
    "s",
    "marks",
    "halifax-area",
    "charges",
    "wildfire",
    "laid",
    "2023",
    "province",
    "upper",
    "tantallon",
    "hammonds",
    "plains",
    "department",
    "natural",
    "resources",
    "statement",
    "lay",
    "connection",
    "anniversary",
    "investigation",
    "wrapped",
    "exhausting",
    "avenues",
    "unable",
    "relation",
    "date",
    "offence",
    "forests",
    "act",
    "sufficient",
    "evidence",
    "secure",
    "conviction",
    "broke"
  ],
  "summary": "The province says no charges will be laid in connection with the 2023 wildfire in Upper Tantallon and Hammonds Plains.\nThe Department of Natural Resources put out a statement on the two year anniversary of the wildfire, saying the investigation has wrapped up.\n“After exhausting all possible avenues, the province is unable to lay charges in relation to the 2023 wildfire in Upper Tantallon/Hammonds Plains,” the statement said.\n“The Department of Natural Resources has two years from the date of an offence to lay charges under the Forests Act.\nCharges are only laid if there is sufficient evidence to secure a conviction.” The fire, which broke out May 28, 2023, burned 969 hectares, destroyed 151 homes, and forced more than 16,000 people to evacuate.",
  "scraped_at": "2025-05-28T16:38:25.231027"
},
{
  "index": 3,
  "title": "#3 Halifax issues closure notice for Geary Street encampment",
  "authors": [
    "Dan Ahlstrand"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/halifax-issues-closure-notice-for-geary-street-encampment/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "forced",
    "close",
    "geary",
    "street",
    "city",
    "encampment",
    "designated",
    "municipality",
    "housing",
    "sites",
    "officials",
    "shelter",
    "temporary",
    "site",
    "individuals",
    "indoor",
    "options",
    "spaces",
    "recorded",
    "halifax",
    "regional",
    "closing",
    "de-designating",
    "green",
    "space",
    "release",
    "media",
    "morning",
    "notices",
    "issued",
    "sheltering",
    "advising",
    "relocate",
    "22",
    "region"
  ],
  "summary": "Halifax Regional Municipality officials say they are closing and de-designating the Geary Street green space as a designated encampment site.\nOfficials say several spaces are available across multiple provincially funded indoor shelters and temporary housing sites.\nThe city says Geary Street has seen consistently low usage over the past three years, and in recent months recorded the lowest occupancy among all designated sites.\nAs of May 23, the municipality recorded 51 tents and four trailers across the remaining designated sites.\nOfficials say the municipality will continue to phase out designated sites as more permanent shelter and housing spaces come online.",
  "scraped_at": "2025-05-28T16:38:25.578318"
},
{
  "index": 5,
  "title": "#5 Overnight closures coming to the Macdonald Bridge",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/overnight-closures-coming-to-the-macdonald-bridge/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "close",
    "multiple",
    "times",
    "bridge",
    "macdonald",
    "closures",
    "continue",
    "traffic",
    "overnight",
    "coming",
    "weeks",
    "scheduled",
    "night",
    "midnight",
    "m",
    "nights",
    "mid-june",
    "28",
    "29",
    "31",
    "11",
    "12",
    "14",
    "15",
    "vehicle",
    "bike",
    "lane",
    "pedestrian",
    "walkway",
    "remain",
    "open",
    "halifax",
    "harbour",
    "bridges",
    "needed"
  ],
  "summary": "Several overnight closures are coming to the Macdonald Bridge over the next few weeks.\nThe first is scheduled for Wednesday night from midnight to 5 a.m. After that, the closures will continue on Wednesday and Saturday nights into mid-June: Wednesday, May 28 – Thursday, May 29 Saturday, May 31 – Sunday, June 1 Wednesday, June 4 – Thursday, June 5 Saturday, June 7- Sunday, June 8 Wednesday, June 11- Thursday, June 12 Saturday, June 14 – Sunday, June 15 The closures will be for vehicle traffic only, the bike lane and pedestrian walkway will remain open.\nHalifax Harbour Bridges says the closures are needed to facilitate ongoing work as part of “Operation Lifespan.” “These closures will allow crews to receive the scaffolding required to continue to build the overhead platforms at the tower, at times that are the least disruptive to traffic and without necessitating a full bridge closure,” reads a media release from HHB.",
  "scraped_at": "2025-05-28T16:38:25.993388"
},
{
  "index": 8,
  "title": "#8 Nearly 1,000 tickets issued in Nova Scotia road safety week",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/nearly-1000-tickets-issued-in-n-s-during-road-safety-week/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "charged",
    "n",
    "s",
    "week",
    "handed",
    "000",
    "road",
    "driving",
    "rcmp",
    "nova",
    "scotia",
    "safety",
    "tickets",
    "primarily",
    "distracted",
    "aggressive",
    "seatbelt",
    "impaired",
    "important",
    "officers",
    "hundreds",
    "drivers",
    "canada",
    "mounties",
    "13",
    "19",
    "summary",
    "offence",
    "issued",
    "wearing",
    "primary",
    "causal",
    "factors",
    "fatal",
    "injury"
  ],
  "summary": "The RCMP in Nova Scotia says hundreds of tickets were handed out to drivers during Canada Road Safety Week in May.\nAccording to the Mounties, between May 13 and 19, nearly 1,000 summary offence tickets were issued, primarily for distracted or aggressive driving and not wearing a seatbelt.\n“As the four primary causal factors for fatal and serious injury collisions in 2024 were impaired driving, distracted driving, aggressive driving (primarily speeding), and failure to use a seatbelt, it was particularly important for officers across Nova Scotia to remind all road users about how we all play a part in keeping Nova Scotia safe,” the RCMP wrote in a media release.\nIn addition, 54 criminal code charges were laid for impaired operation along with 22 provincial roadside suspensions.\nThe RCMP says while road safety is always important, officers used road safety week to prioritize proactive and preventative interactions with the public.",
  "scraped_at": "2025-05-28T16:38:26.411767"
},
{
  "index": 2,
  "title": "#2 RCMP narrows down timeline of Sullivan children disappearance; asks for public videos",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/rcmp-narrows-down-timeline-of-sullivan-children-disappearance-asks-for-public-videos/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "release",
    "rcmp",
    "children",
    "sullivan",
    "timeline",
    "missing",
    "jack",
    "00",
    "m",
    "martell",
    "confirmed",
    "public",
    "nova",
    "lilly",
    "family",
    "we’ve",
    "major",
    "unit",
    "gairloch",
    "road",
    "12",
    "p",
    "press",
    "disappearance",
    "place",
    "days",
    "search",
    "nearby",
    "alive",
    "asked",
    "investigators",
    "rural",
    "scotia",
    "community",
    "month"
  ],
  "summary": "Investigators said they have confirmed the last time two missing children were seen in public in a rural Nova Scotia community.\nLilly, 6, and Jack Sullivan, 4, have been missing for almost a month, and now the RCMP said they have a timeline of when they were last seen by other people outside of their immediate family.\nSandy Matharu, Northeast Nova RCMP Major Crime Unit.\nThe Mounties add in the press release that they are “committed to exploring all possibilities” surrounding the children’s disappearance.\nSince the beginning, Martell has asked the RCMP to look into whether the two were abducted, but police have said there is no evidence of that.",
  "scraped_at": "2025-05-28T16:38:26.872298"
},
{
  "index": 4,
  "title": "#4 N.S. NDP says rent supplements underpaid, calls for stronger protections",
  "authors": [
    "Dan Ahlstrand"
  ],
  "url": "https://halifax.citynews.ca/2025/05/28/ns-ndp-says-rent-supplements-underpaid-calls-for-stronger-protections/",
  "publish_date": "2025-05-28T00:00:00",
  "keywords": [
    "n",
    "s",
    "calls",
    "stronger",
    "protections",
    "rent",
    "supplements",
    "ndp",
    "underpaid",
    "housing",
    "nova",
    "hansen",
    "supply",
    "cent",
    "scotia’s",
    "calling",
    "province",
    "improve",
    "supplement",
    "program",
    "freedom",
    "information",
    "department",
    "minister",
    "balser",
    "reporters",
    "vacancy",
    "democrats",
    "recent",
    "request",
    "revealed",
    "houston",
    "residents",
    "rely",
    "rental"
  ],
  "summary": "Nova Scotia’s New Democrats are calling on the province to improve its rent supplement program.\nAccording to the NDP, a recent freedom of information request revealed the Houston government underpaid residents who rely on rental supplements.\nNova Scotia’s year-over-year rent growth is 2.4 per cent as of March, rising to $2,199.\nHansen is calling on the province to improve the rent supplement program by strengthening renter protections and making more investments in housing.\nHowever, she did not specify how the housing supply would be affected under repeated questioning by reporters.",
  "scraped_at": "2025-05-28T16:38:27.245169"
},
{
  "index": 7,
  "title": "#7 Man arrested following hit-and-run in Fall River",
  "authors": [
    "Chris Halef"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/man-arrested-following-hit-and-run-in-fall-river/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "arrested",
    "fall",
    "river",
    "man",
    "hit-and-run",
    "dodge",
    "ram",
    "dirt",
    "bike",
    "showed",
    "test",
    "officer",
    "arrest",
    "investigating",
    "place",
    "week",
    "roughly",
    "p",
    "m",
    "emergency",
    "crews",
    "responded",
    "report",
    "collision",
    "1400",
    "block",
    "road",
    "collided",
    "travelling",
    "direction",
    "youth",
    "riders",
    "suffered",
    "injuries",
    "transported"
  ],
  "summary": "Police are investigating a hit-and-run that took place in Fall River last week.\nOn Friday at roughly 10 p.m., emergency crews responded to a report of a collision near the 1400 block of Fall River Road where a Dodge Ram collided with a dirt bike travelling in the same direction.\nPolice said two of the three youth dirt bike riders suffered serious injuries and were transported to hospital by EHS while the third rider was uninjured.\nMounties later found the Dodge Ram at a nearby gas station and the male driver showed signs of impairment and then completed a breathlyzer test which showed he was not impaired by alcohol.\nOfficers then demanded that the 45-year-old man from Fletchers Lake perform a standard field sobriety test and when he refused, he was arrested.",
  "scraped_at": "2025-05-28T16:38:27.676662"
},
{
  "index": 10,
  "title": "#10 Councillor calls for municipal strategy to tackle commercial, industrial litter",
  "authors": [
    "Mark Hodgins"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/councillor-calls-for-municipal-strategy-to-tackle-commercial-and-industrial-litter/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "tackle",
    "litter",
    "strategy",
    "commercial",
    "industrial",
    "councillor",
    "municipal",
    "calls",
    "motion",
    "hartling",
    "report",
    "debris",
    "bylaw",
    "regional",
    "council",
    "set",
    "meet",
    "hoping",
    "ball",
    "rolling",
    "district",
    "13",
    "nancy",
    "requesting",
    "staff",
    "outlining",
    "comprehensive",
    "writes",
    "intent",
    "address",
    "significant",
    "overlooked",
    "source",
    "referring",
    "construction-related"
  ],
  "summary": "Regional council is set to meet on Tuesday, and one councillor is hoping to get the ball rolling on a municipal litter strategy.\nA motion from District 13 Councillor Nancy Hartling is requesting a staff report outlining a comprehensive litter strategy.\nIn her motion, Hartling writes that the intent is to address what she calls a “significant and often overlooked source of litter,” referring to commercial, industrial and construction-related debris.\nHartling says that public messaging often targets individuals, but much of the litter along roads and highways comes from commercial activities.\nThe motion asks for a report that includes a targeted litter management strategy, reasonable and sustainable bylaw enforcement for commercial and industrial sources of litter, and compelling fines for bylaw infractions.",
  "scraped_at": "2025-05-28T16:38:28.093179"
},
{
  "index": 6,
  "title": "#6 Nova Scotia has the highest police-reported hate crime rate in the country",
  "authors": [
    "Natasha O'Neill"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/nova-scotia-has-the-highest-police-reported-hate-crime-rate-in-the-country/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "nova",
    "scotia",
    "highest",
    "hate",
    "crimes",
    "incidents",
    "cent",
    "data",
    "crime",
    "100",
    "000",
    "canada",
    "police-reported",
    "rate",
    "notes",
    "shows",
    "provinces",
    "report",
    "country",
    "recorded",
    "reported",
    "statcan",
    "number",
    "increased",
    "sheppard",
    "officers",
    "assault",
    "place",
    "targeting",
    "religion",
    "sexual",
    "community",
    "population",
    "statistics",
    "released"
  ],
  "summary": "New data from Statistics Canada shows that Nova Scotia has the highest police-reported hate crime rate among the provinces.\nIn Nova Scotia, that number jumps to 18.2 incidents per 100,000 people.\nJust last week, RCMP officers said they are investigating an alleged assault on fishers in the Eastern Passage as a hate crime.\nHate crimes against those in the 2SLGBTQIA+ community targeted the gay and lesbian populations, lower than in the previous years, StatCan notes.\nThe lowest rate was recorded in Newfoundland and Labrador with 3.3 incidents per 100,000 population.",
  "scraped_at": "2025-05-28T16:38:28.554864"
},
{
  "index": 9,
  "title": "#9 U-Haul driver charged after escaping police, crashing in Halifax's west end",
  "authors": [
    "Dan Ahlstrand"
  ],
  "url": "https://halifax.citynews.ca/2025/05/27/u-haul-driver-charged-after-fleeing-police-and-crashing-in-halifaxs-west-end/",
  "publish_date": "2025-05-27T00:00:00",
  "keywords": [
    "haul",
    "custody",
    "evading",
    "crashing",
    "driver",
    "vehicle",
    "halifax",
    "officers",
    "van",
    "man",
    "weapons",
    "complaint",
    "ended",
    "collision",
    "p",
    "m",
    "responded",
    "u-haul",
    "fled",
    "scene",
    "operation",
    "conveyance",
    "regional",
    "charged",
    "series",
    "incidents",
    "began",
    "week",
    "23",
    "approximately",
    "45",
    "5100",
    "block",
    "george",
    "street"
  ],
  "summary": "Halifax Regional Police have charged a man after a series of incidents that began with a weapons complaint and ended with a collision in Halifax last week.\nOn May 23 at approximately 10:45 p.m., officers responded to a weapons complaint near the 5100 block of George Street.\nThe van was located, but the driver failed to stop and escaped at a high rate of speed.\nAt around 11:15 p.m., officers responded to a collision at the intersection of Connaught Avenue and Quinpool Road.\nThe driver of the vehicle that was hit was taken to hospital with what are believed to be non-life-threatening injuries.",
  "scraped_at": "2025-05-28T16:38:28.956393"
}
]