[
{
  "index": 1,
  "title": "#1 Nova Scotia Power CEO, staff grilled by politicians over cybersecurity breach",
  "authors": [
    "The Canadian Press",
    "globalnewsdigital"
  ],
  "url": "https://globalnews.ca/news/11212530/nova-scotia-power-breach/",
  "publish_date": "2025-06-04T12:50:08-04:00",
  "keywords": [
    "ceo",
    "staff",
    "grilled",
    "politicians",
    "halifax",
    "nova",
    "scotia",
    "power",
    "breach",
    "cybersecurity",
    "gregg",
    "customers",
    "utility",
    "committee",
    "insurance",
    "numbers",
    "scotians",
    "social",
    "meeting",
    "ratepayers",
    "chender",
    "answer",
    "trust",
    "000",
    "members",
    "company",
    "told",
    "ndp",
    "investigation",
    "province’s",
    "data",
    "half",
    "utility’s",
    "public",
    "understand"
  ],
  "summary": "Nova Scotians have lost trust in the province’s largest electric utility, provincial politicians said Wednesday during a heated committee meeting that raised tough questions about the recent ransomware attack on Nova Scotia Power.\nMembers of the public accounts committee grilled Nova Scotia Power CEO Peter Gregg and two other senior staff members, asking them how the breach happened and what the company will do to protect ratepayers from financial harm.\nStill, Chender pressed utility executives to explain why Nova Scotia Power continues to store the full social insurance numbers it had previously collected.\nHe said Nova Scotia Power’s cybersecurity insurance would likely cover many expenses, but he said the utility doesn’t yet know the cost of the breach.\n“There is no trust with Nova Scotia Power right now,” Mombourquette said after the meeting.",
  "scraped_at": "2025-06-04T19:14:44.702935"
},
{
  "index": 6,
  "title": "#6 Eby fires back at Ford over suggestion B.C. would accept 2nd oil pipeline",
  "authors": [
    "The Canadian Press",
    "globalnewsdigital"
  ],
  "url": "https://globalnews.ca/news/11211654/eby-ford-bc-pipeline/",
  "publish_date": "2025-06-03T20:26:19-04:00",
  "keywords": [
    "fires",
    "accept",
    "2nd",
    "eby",
    "b",
    "pipeline",
    "oil",
    "ford",
    "suggestion",
    "premier",
    "support",
    "province",
    "ford’s",
    "british",
    "northern",
    "it’s",
    "job",
    "alberta",
    "meeting",
    "premiers",
    "carney",
    "david",
    "won’t",
    "throwing",
    "dismissing",
    "ontario",
    "doug",
    "change",
    "mind",
    "response",
    "remarks",
    "publicly-owned",
    "tmx",
    "running",
    "doesn’t"
  ],
  "summary": "Premier David Eby says he won’t be throwing his support behind a new oil pipeline through the province, dismissing Ontario Premier Doug Ford’s suggestion that Eby would change his mind.\nEby says in response to Ford’s remarks on Monday that the publicly-owned TMX pipeline is already running through B.C., and the province doesn’t support lifting the ban on oil tankers off British Columbia’s northern coast.\nHe says it’s not his job to tell Ford it’s “extremely unlikely” there will be a tunnel under Toronto’s Highway 401, or tell Alberta Premier Danielle Smith her “vision” for a pipeline connecting Alberta and northern B.C.\nStory continues below advertisement Eby says his job instead is to protect the interests of British Columbia by bringing forward “shovel-ready” projects.\nEby was speaking Tuesday from Osaka, Japan, on a 10-day trade mission in Asia, and deputy premier Niki Sharma represented B.C.",
  "scraped_at": "2025-06-04T19:14:46.166960"
},
{
  "index": 5,
  "title": "#5 3 missing sisters found dead in Washington state, father wanted for murders",
  "authors": [
    "Michelle Butterfield"
  ],
  "url": "https://globalnews.ca/news/11210738/missing-sisters-dead-wentachee-travis-decker-wanted-murder/",
  "publish_date": "2025-06-03T14:31:31-04:00",
  "keywords": [
    "wanted",
    "missing",
    "father",
    "washington",
    "state",
    "sisters",
    "dead",
    "murders",
    "decker",
    "local",
    "girls",
    "search",
    "day",
    "patrol",
    "endangered",
    "alert",
    "wenatchee",
    "planned",
    "visitation",
    "motels",
    "area",
    "continues",
    "advertisement",
    "issued",
    "truck",
    "young",
    "reported",
    "suspected",
    "deaths",
    "nine-year-old",
    "paityn",
    "eight-year-old",
    "evelyn",
    "five-year-old",
    "olivia"
  ],
  "summary": "Three young sisters reported missing from Washington state have been found dead and now the search is on for their father, who is suspected of the murders.\nThe news of the deaths of nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker came Tuesday morning, a day after Washington State Patrol called off an endangered missing persons alert for the siblings.\nStory continues below advertisement The following day, Washington State Patrol issued an endangered missing person alert, declared the girls and their father “at-risk/missing,” and shared a photo of their dad’s 2017 white GMC Sierra pickup truck.\nWenatchee police say it’s unknown if Decker is armed but he is a military veteran with extensive training.\nStory continues below advertisement Decker is described at five feet, eight inches, 190 pounds, with black hair and brown eyes.",
  "scraped_at": "2025-06-04T19:14:47.275418"
},
{
  "index": 4,
  "title": "#4 Carney calls U.S. 50% steel, aluminum tariffs ‘illegal’",
  "authors": [
    "Sean Previl"
  ],
  "url": "https://globalnews.ca/news/11212083/trump-steel-aluminum-tariffs-doubled-now-in-effect/",
  "publish_date": "2025-06-04T08:57:39-04:00",
  "keywords": [
    "calls",
    "50",
    "illegal",
    "steel",
    "tariffs",
    "s",
    "aluminum",
    "carney",
    "national",
    "canadian",
    "canada",
    "industry",
    "cent",
    "industries",
    "rate",
    "workers",
    "tariff",
    "jobs",
    "president",
    "doubling",
    "25",
    "minister",
    "imports",
    "they’re",
    "american",
    "told",
    "reporters",
    "cobden",
    "we’re",
    "it’s",
    "federal",
    "countries",
    "including",
    "response",
    "security"
  ],
  "summary": "Prime Minister Mark Carney called U.S. President Donald Trump‘s doubling of tariffs on steel and aluminum imports “illegal,” and said the federal government would take “some time” to consider its next steps.\n“The latest tariffs on steel and aluminum are unjustified, they’re illegal, they’re bad for American workers, bad for American industry, and of course for Canadian industry as well,” Carney said.\nCanada’s steel and aluminum industries have warned that doubling the rate would have damaging impacts for producers and the North American supply chains.\n“The steel and aluminum tariffs will apply only to the steel and aluminum contents of imported products, whereas the non-steel and non-aluminum contents of imported products will be subject to other applicable tariffs,” the White House said in reference to other countries.\nCanadian industry leaders have warned that North American supply chains could face “unrecoverable consequences” if the higher tariffs remain in place.",
  "scraped_at": "2025-06-04T19:14:48.182482"
},
{
  "index": 11,
  "title": "#11 N.S. works to expand cell coverage, stop gaps in community where 2 kids disappeared",
  "authors": [
    "Skye Bryden-Blom"
  ],
  "url": "https://globalnews.ca/news/11210984/nova-scotia-cell-service-gaps/",
  "publish_date": "2025-06-04T05:00:01-04:00",
  "keywords": [
    "n",
    "s",
    "works",
    "stop",
    "kids",
    "disappeared",
    "halifax",
    "cell",
    "coverage",
    "gaps",
    "expand",
    "community",
    "province",
    "towers",
    "phase",
    "nova",
    "communities",
    "access",
    "province’s",
    "000",
    "program",
    "launched",
    "upgraded",
    "department",
    "emergency",
    "service",
    "missing",
    "search",
    "communications",
    "goal",
    "close",
    "working",
    "scotians",
    "living",
    "prevent"
  ],
  "summary": "The province is working to expand cell coverage for Nova Scotians living in communities without access, and it also wants to prevent dropped calls and signal gaps along the province’s major highways.\nThe province’s cell expansion program launched in October 2023 and is rolling out in phases.\nThis represents a substantial accomplishment just 18 months after the program launched,” said Paul LaFleche, Department of Public Works Executive Deputy Minister.\nThe government has faced pressure in recent years around the lack of cell coverage in rural communities during emergencies.\nThen, the goal of Phase 2 is to close remaining gaps in coverage with 27 new provincially-owned communications towers.",
  "scraped_at": "2025-06-04T19:14:48.590331"
},
{
  "index": 10,
  "title": "#10 N.S. police continue investigation into Esther Jones homicide, remains never found",
  "authors": [
    "Rebecca Lau"
  ],
  "url": "https://globalnews.ca/news/11212260/esther-jones-homicide-rcmp-investigation/",
  "publish_date": "2025-06-04T11:28:30-04:00",
  "keywords": [
    "halifax",
    "s",
    "jones",
    "n",
    "remains",
    "esther",
    "homicide",
    "investigation",
    "continue",
    "rcmp",
    "greenwood",
    "continues",
    "expect",
    "murder",
    "crime",
    "days",
    "sept",
    "2024",
    "advertisement",
    "information",
    "toole",
    "detained",
    "canada",
    "family",
    "it’s",
    "rcmp’s",
    "major",
    "unit",
    "community",
    "week",
    "speak",
    "conduct",
    "interviews",
    "search",
    "they’ve"
  ],
  "summary": "RCMP’s major crime unit will be back in the community of Greenwood, N.S., this week to speak to people and conduct interviews as they continue to search for remains in the homicide of Esther Jones.\nPolice said they’ve interviewed more than 100 people and obtained video surveillance from more than 50 businesses and homes.\nJones, 55, was reported missing from Torbrook, N.S., in Annapolis County, on Sept. 2, 2024 and was last seen at the Kingston Bible College in Greenwood two days earlier.\nHe has since been charged with first-degree murder and remains in custody.\nEsther Uhlman, who was named after her aunt Esther, called the whole ordeal “a shock.” “You never expect to have your family deal with a murder, especially that close.",
  "scraped_at": "2025-06-04T19:14:48.929439"
},
{
  "index": 13,
  "title": "#13 Ross Farm, popular N.S. tourism spot, making changes to animal care amid backlash",
  "authors": [
    "Skye Bryden-Blom"
  ],
  "url": "https://globalnews.ca/news/11208886/ross-farm-animal-care-changes/",
  "publish_date": "2025-06-03T05:00:58-04:00",
  "keywords": [
    "tourism",
    "spot",
    "making",
    "animal",
    "amid",
    "backlash",
    "halifax",
    "farm",
    "ross",
    "s",
    "care",
    "popular",
    "n",
    "horses",
    "museum",
    "tassé",
    "concerns",
    "animals",
    "it’s",
    "site",
    "balance",
    "modern",
    "things",
    "we’ve",
    "fraser",
    "stalls",
    "bit",
    "upgrades",
    "vote",
    "return",
    "lot",
    "nova",
    "scotia",
    "social",
    "media"
  ],
  "summary": "A popular Nova Scotia farm and museum that came under fire on social media last month over concerns around the animals’ welfare now says improvements have been made.\nRoss Farm Museum in New Ross, N.S., operates as a living heritage site — giving visitors a glimpse of what life was like in the 1800s.\nIts executive director, Marc Tassé, says it’s hard to balance its preservation with the installation of modern amenities.\nSo that balance between history and modern standards has been something that we’ve been working on rebalancing,” said Tassé.\nIn response, Tassé says the museum is now focused on assuring the public the horses will be well care for when they return.",
  "scraped_at": "2025-06-04T19:14:49.271995"
},
{
  "index": 12,
  "title": "#12 Man charged with kidnapping and sexual offences against child in N.S.",
  "authors": [
    "Rebecca Lau"
  ],
  "url": "https://globalnews.ca/news/11210873/sexual-offences-admiral-rock-ns/",
  "publish_date": "2025-06-03T15:15:40-04:00",
  "keywords": [
    "charged",
    "kidnapping",
    "offences",
    "halifax",
    "man",
    "child",
    "sexual",
    "n",
    "s",
    "residence",
    "34-year-old",
    "invitation",
    "touching",
    "grabbed",
    "rcmp",
    "admiral",
    "rock",
    "officers",
    "children",
    "threats",
    "court",
    "nova",
    "scotia",
    "facing",
    "charges",
    "including",
    "kidnaping",
    "allegedly",
    "pulled",
    "stranger",
    "responded",
    "abduction",
    "report",
    "afternoon",
    "20"
  ],
  "summary": "A 34-year-old Nova Scotia man is facing various charges, including kidnaping and invitation to sexual touching, after a child was allegedly grabbed and then pulled into a residence by a stranger.\nRCMP said they responded to the abduction report on Monday afternoon at around 3:20 p.m. on Mosher Road in Admiral Rock, N.S.\nTrending Now Ellen Pompeo says she was detained by TSA, bomb squad over sunflower seeds ‘Let truth be revealed’: What was said at candlelight vigil for missing N.S.\nkids Responding officers went to the residence and arrested a 34-year-old man from Admiral Rock — a small community in Hants County.\nGregory McDonald was charged with kidnapping, invitation to sexual touching, indecent act- exposure, assault and uttering threats.",
  "scraped_at": "2025-06-04T19:14:49.614657"
},
{
  "index": 14,
  "title": "#14 Hants County, N.S., residents rally to oppose uranium mining in the region",
  "authors": [
    "The Canadian Press",
    "globalnewsdigital"
  ],
  "url": "https://globalnews.ca/news/11209289/hants-county-n-s-residents-rally-to-oppose-uranium-mining/",
  "publish_date": "2025-06-02T16:32:25-04:00",
  "keywords": [
    "rally",
    "oppose",
    "region",
    "halifax",
    "uranium",
    "county",
    "mining",
    "hants",
    "n",
    "s",
    "residents",
    "province",
    "meeting",
    "voiced",
    "concerns",
    "potential",
    "consultation",
    "trask",
    "community",
    "exploration",
    "site",
    "resources",
    "discuss",
    "lack",
    "millet",
    "brook",
    "local",
    "hasn’t",
    "consulted",
    "request",
    "proposals",
    "companies",
    "natural",
    "speakers",
    "municipal"
  ],
  "summary": "A Hants County, N.S., resident who planned a weekend meeting to discuss uranium mining in the area says residents in attendance voiced concerns about potential environmental and health harms and a lack of government consultation.\nSarah Trask, who lives in the community of Vaughan, N.S., said in an interview Monday the community meeting to discuss proposed uranium mining in nearby Millet Brook filled a local fire station Saturday.\nThe locations are: an 80-hectare site in Louisville in Pictou County; a 64-hectare site in East Dalhousie in Annapolis County; and a 2,300-hectare site in Millet Brook in Hants County.\nSome of these speakers voiced concerns that uranium exploration could result in potential water contamination or exposure to radon gas and radioactive dust.\nThe Nova Scotia Assembly of Mi’kmaw Chiefs has repeatedly voiced concerns about government’s lack of consultation with its communities as Nova Scotia pushes to develop natural resources.",
  "scraped_at": "2025-06-04T19:14:49.967302"
},
{
  "index": 7,
  "title": "#7 Ellen Pompeo says she was detained by TSA, bomb squad over sunflower seeds",
  "authors": [
    "Katie Scott"
  ],
  "url": "https://globalnews.ca/news/11210421/ellen-pompeo-detained-tsa-bomb-squad-sunflower-seeds/",
  "publish_date": "2025-06-03T13:19:37-04:00",
  "keywords": [
    "ellen",
    "detained",
    "national",
    "sunflower",
    "seeds",
    "pompeo",
    "tsa",
    "bomb",
    "squad",
    "flight",
    "plane",
    "bag",
    "cuoco",
    "wine",
    "security",
    "continues",
    "advertisement",
    "opener",
    "bags",
    "star",
    "organic",
    "expensive",
    "told",
    "travel",
    "asked",
    "don’t",
    "recognize",
    "luggage",
    "pat-down",
    "ex-husband",
    "bad",
    "happen",
    "gucci",
    "purse",
    "agent"
  ],
  "summary": "“I had a bag of sunflower seeds, like organic sunflower seeds from Erewhon, so they were probably the most expensive sunflower seeds money can buy,” Pompeo told Travel + Leisure in an interview.\n“They said it was most likely a chemical on the packaging of these super expensive, fancy, organic, clean sunflower seeds.\nPompeo said she asked the TSA agents whether they could just throw out the sunflower seeds, but they said they needed her to wait for the bomb squad to assess them.\nStory continues below advertisement She said the TSA agent went through her bag and found a wine opener.\nShe said that once the TSA agent started going through all of her bags, she found a second wine opener.",
  "scraped_at": "2025-06-04T19:14:50.380154"
},
{
  "index": 9,
  "title": "#9 Bank of Canada holds interest rate steady again amid trade war",
  "authors": [
    "Ari Rabinovitch"
  ],
  "url": "https://globalnews.ca/news/11212073/bank-of-canada-interest-rate-decision-june-2025/",
  "publish_date": "2025-06-04T07:39:16-04:00",
  "keywords": [
    "holds",
    "steady",
    "amid",
    "trade",
    "war",
    "national",
    "bank",
    "interest",
    "rate",
    "canada",
    "inflation",
    "rates",
    "tariffs",
    "businesses",
    "macklem",
    "cut",
    "prices",
    "policy",
    "central",
    "measures",
    "reports",
    "cpi",
    "it’s",
    "growth",
    "cent",
    "meeting",
    "economic",
    "announcement",
    "core",
    "underlying",
    "moved",
    "expected",
    "economy",
    "costs",
    "they’re"
  ],
  "summary": "Interest rates in Canada are staying put for now, after the Bank of Canada held its monetary policy steady on Wednesday.\nThe benchmark, or overnight, lending rate stands at 2.75 per cent, and represents the floor level of interest off of which banks can base their “prime” rate.\n“The Bank’s preferred measures of core inflation, as well as other measures of underlying inflation, moved up in April,” said Macklem.\nFor those Canadians that may be waiting on the sidelines to purchase a home, it may not be worth waiting for interest rates to drop further to apply for a mortgage.\nThe May CPI report will be released on June 24, and the next interest rate announcement from the Bank of Canada comes on July 30.",
  "scraped_at": "2025-06-04T19:14:51.846052"
},
{
  "index": 2,
  "title": "#2 U.S. ‘can’t fight a war’ without American steel, Trump tariff chief says",
  "authors": [
    "Sean Boynton"
  ],
  "url": "https://globalnews.ca/news/11212357/donald-trump-tariffs-steel-aluminum-lutnick-war-canada/",
  "publish_date": "2025-06-04T14:22:56-04:00",
  "keywords": [
    "chief",
    "national",
    "steel",
    "s",
    "war",
    "tariff",
    "can’t",
    "fight",
    "trump",
    "american",
    "tariffs",
    "aluminum",
    "lutnick",
    "canadian",
    "shaheen",
    "defence",
    "it’s",
    "issue",
    "production",
    "continues",
    "advertisement",
    "cent",
    "industry",
    "company",
    "domestic",
    "materials",
    "trump’s",
    "hampshire",
    "don’t",
    "supplies",
    "rate",
    "50",
    "equipment",
    "united",
    "states"
  ],
  "summary": "U.S. Commerce Secretary Howard Lutnick on Wednesday defended the doubling of steel and aluminum tariffs by claiming the United States “can’t fight a war” without domestic production of those materials.\n“If you don’t have the ability to make your own steel and aluminum, you can’t fight a war, and that is what the president’s doing.\nIn her exchange with Lutnick, Shaheen highlighted concerns from a ball bearing manufacturer in her state that supplies the U.S. aerospace industry.\n“We have to have a steel industry that’s ready for American defence.” U.S. defence and aerospace manufacturers have relied on Canadian steel and aluminum for decades — including in wartime.\nTo this day, Canadian steel and aluminum is used to build American aircraft, missiles, space technologies and other equipment.",
  "scraped_at": "2025-06-04T19:14:52.282729"
},
{
  "index": 1,
  "title": "#1 NDP to vote no in 1st government confidence vote on throne speech",
  "authors": [
    "The Canadian Press",
    "globalnewsdigital"
  ],
  "url": "https://globalnews.ca/news/11212057/throne-speech-confidence-vote-carney-government/",
  "publish_date": "2025-06-04T07:02:07-04:00",
  "keywords": [
    "vote",
    "1st",
    "national",
    "speech",
    "throne",
    "confidence",
    "ndp",
    "party",
    "davies",
    "liberals",
    "mps",
    "leader",
    "caucus",
    "canadians",
    "house",
    "it’s",
    "mark",
    "election",
    "support",
    "liberal",
    "parties",
    "government’s",
    "meeting",
    "parliament",
    "details",
    "plans",
    "mackinnon",
    "matter",
    "carney’s",
    "economic",
    "pass",
    "minority",
    "reply",
    "building",
    "opposition"
  ],
  "summary": "New Democrat MPs are set to vote against the government’s throne speech Wednesday, interim NDP Leader Don Davies said.\nIf the government loses a confidence vote, it’s defeated — which could lead to a snap election.\nDavies said that while Canadians don’t want an election right now, his party is taking a “principled approach.” “It’s a clear message that this throne speech is not a worker-centric throne speech,” he said.\n“We can’t support a throne speech that so badly misses the mark in terms of the economic and social policies that people need in this country.” MacKinnon said before the Liberal caucus meeting on Wednesday that the caucus is confident the throne speech will pass.\nIn the House of Commons Wednesday, during a debate on the reply to the throne speech, Green Party Leader Elizabeth May said she will vote in favour of the speech.",
  "scraped_at": "2025-06-04T19:14:52.650350"
}
]