[
{
  "title": "Book awards week: Celebrating writing and authors",
  "authors": [
    "Philip Moscovitch"
  ],
  "url": "https://www.halifaxexaminer.ca/morning-file/book-awards-week-celebrating-writing-and-authors/",
  "publish_date": "2025-06-03 14:22:51",
  "keywords": [
    "week",
    "celebrating",
    "authors",
    "awards",
    "writing",
    "book",
    "potato",
    "nova",
    "scotia",
    "ship",
    "halifax",
    "writers",
    "events",
    "it’s",
    "item",
    "arrives",
    "00",
    "public",
    "copy",
    "island",
    "online",
    "link",
    "award",
    "send",
    "click",
    "leader",
    "rcmp",
    "30",
    "details",
    "container",
    "sails",
    "point",
    "told",
    "poppadoms",
    "province"
  ],
  "summary": "Speaking of valuing writing, it’s book awards week in Nova Scotia.\nThe Nova Scotia Book Awards were held last night at the Brightwood Golf & Country Club in Dartmouth (more on that in a minute) and there is a whole slew of other events this week, leading up to the Atlantic Book Awards gala on Thursday, June 5, at the Halifax Central Library.\n(I sit ex officio on the board of the Writers’ Federation of Nova Scotia, which presents some of the awards, but had no direct involvement with any of the awards, presentations, or other events related to them).\nShe also has taught writing courses for teens, with all the participants using typewriters, and says it’s gone over great.\nChurchill’s lobbying is intended to help Freeman Lumber “meet with relevant federal ministries and agencies to discuss the economic importance of the Forestry Sector in Nova Scotia,” and “the need to support forest exports to non-US markets, particularly the establishment of a new pulp mill in Nova Scotia.”… That means Churchill is lobbying on behalf of not just Freeman Lumber, but also for a coalition that includes the Nova Scotia government, for federal funding for a new pulp mill in Nova Scotia."
},
{
  "title": "Premier Houston’s government is promoting uranium exploration and mining, and the frenzy of laying claim to Nova Scotia has begun",
  "authors": [
    "Joan Baxter"
  ],
  "url": "https://www.halifaxexaminer.ca/economy/natural-resources/mining/premier-houstons-government-is-promoting-uranium-exploration-and-mining-and-the-frenzy-of-laying-claim-to-nova-scotia-has-begun/",
  "publish_date": "2025-06-03 23:00:40",
  "keywords": [
    "week",
    "meetings",
    "premier",
    "houston’s",
    "promoting",
    "mining",
    "frenzy",
    "laying",
    "claim",
    "scotia",
    "begun",
    "nova",
    "uranium",
    "exploration",
    "past",
    "upset",
    "worried",
    "scotians",
    "flocking",
    "speak",
    "communities",
    "planned"
  ],
  "summary": "In the past week, upset and worried Nova Scotians have been flocking to meetings to speak out against uranium exploration in and around their communities.\nMore meetings are planned this week."
},
{
  "title": "Judge rules federal minister must rework document for piping plover",
  "authors": [
    "Suzanne Rent"
  ],
  "url": "https://www.halifaxexaminer.ca/justice/crime-and-courts/judge-rules-federal-minister-must-rework-document-for-piping-plover/",
  "publish_date": "2025-06-04 11:18:10",
  "keywords": [
    "judge",
    "rules",
    "federal",
    "minister",
    "rework",
    "piping",
    "plover",
    "document",
    "dispute",
    "appears",
    "relate",
    "drafting",
    "wrote",
    "justice",
    "richard",
    "southcott",
    "decision"
  ],
  "summary": "“The dispute appears to relate to the drafting of the document,” wrote Justice Richard Southcott in his decision."
},
{
  "title": "Halifax council starts review of regional plan",
  "authors": [
    "Suzanne Rent"
  ],
  "url": "https://www.halifaxexaminer.ca/government/city-hall/halifax-council-starts-review-of-regional-plan/",
  "publish_date": "2025-06-04 12:15:24",
  "keywords": [
    "halifax",
    "starts",
    "review",
    "regional",
    "council",
    "plan",
    "continue",
    "discusses",
    "phase",
    "week"
  ],
  "summary": "Council to continue discusses on Phase 4 of the plan next week."
},
{
  "title": "Today's Most Ridiculously Credulous Reporting Award goes to Guardian reporter Michael Savage",
  "authors": [
    "Tim Bousquet"
  ],
  "url": "https://www.halifaxexaminer.ca/morning-file/todays-most-ridiculously-credulous-reporting-award-goes-to-guardian-reporter-michael-savage/",
  "publish_date": "2025-06-04 14:18:54",
  "keywords": [
    "today's",
    "ridiculously",
    "credulous",
    "reporting",
    "award",
    "guardian",
    "michael",
    "reporter",
    "savage",
    "halifax",
    "nova",
    "uranium",
    "examiner",
    "it’s",
    "plan",
    "scotia",
    "regional",
    "00",
    "money",
    "click",
    "companies",
    "details",
    "exploration",
    "oil",
    "piping",
    "thing",
    "ai",
    "mining",
    "exploratory",
    "day",
    "work",
    "online",
    "small",
    "plover",
    "coast"
  ],
  "summary": "The first thing I do every morning, even before starting the coffee, is check the Halifax Examiner financials.\nHalifax council starts review of regional plan Suzanne Rent reports: Halifax regional council got a chance to discuss and debate an update to the Halifax Regional Municipal Planning Strategy during a special meeting on Tuesday.\nThe Halifax Regional Municipal Planning Strategy, otherwise known as the regional plan, sets out a long-term vision for planning across Halifax Regional Municipality (HRM).\nThe regional plan is now in phase four, and builds on the first regional plan that was adopted in 2006.\nThe regional plan also includes plans and strategies from council, including HalifACT and the Integrated Mobility Plan (IMP)."
}
]